{"questions": {"0151eedd-48d2-451c-bb6e-faaf97327a39": "What is the new name for unwanted AI-generated content mentioned in May?", "d5968e6c-120d-4953-bc5a-bea6a5452746": "What are the options for accessing Llama 3 from the terminal?", "6f78663f-9c48-4ec7-839a-289346084e0c": "What is the name of the model that the author runs on their iPhone?", "347ea761-edb3-486d-8669-15a16ef3b439": "How can hobbyists create their own fine-tuned models according to the context?", "409e618a-b5f0-4165-9e1c-7f86191c119e": "What is the relationship between prompt injection and gullibility as mentioned in the context?", "8cc9dca6-f10d-46f3-8dfe-90dccf675cf9": "How has the discussion around tackling prompt injection evolved since September 2022?", "56a8709b-b837-4efa-b6ef-c63ecb2e6c48": "What are some ways the author has used LLMs to improve productivity and entertainment?", "f46e4f84-fb8f-4a51-8e53-aed8360d15a5": "What concerns do some people have regarding the value and impact of LLMs?", "fee75ab9-9ea9-4872-ba9f-c095f3723618": "What is the author's perspective on the environmental impact of plagiarism machines in the field discussed?", "aca94740-bdb8-46cc-bfaf-30eefdc5d3c0": "What does the author believe is necessary to help others understand the value in this field?", "c9b4563c-23fa-4f98-8eba-18c18f4ee718": "What significant event regarding the term \"Artificial Intelligence\" occurred on January 7th?", "0b9b1800-01a0-418b-a06d-ed48464df028": "What was discussed on March 5th regarding prompt injection and jailbreaking?", "6e462cb2-788a-4bca-9ad4-cdaa9e32a476": "What are some of the new capabilities introduced in multi-modal models that enhance their functionality beyond text?", "2da1bcb6-0e78-4254-9660-478fe6888089": "How did OpenAI enable voice interactions with ChatGPT in September 2023?", "919ecc00-5bc9-4abb-8905-75f29bbed7aa": "How have US export regulations on GPUs to China influenced training optimizations in AI models?", "2d2a4f5f-8ffa-433f-b53c-9927255b5d4e": "What changes have occurred in the energy usage and environmental impact of running AI prompts over the past couple of years?", "e0fcd1d2-6a94-4fec-8802-b14f46c756ca": "What is the total cost to generate short descriptions for all 68,000 photos using Google’s Gemini 15 Flash 8B?", "7d9bd05b-399c-4f66-8839-45cb7c66a240": "How many input and output tokens are required to generate descriptions for the personal photo library mentioned in the context?", "6c5c7551-3afb-4699-ac7f-f4322d001947": "What advancements were made in running GPT-4 class models on personal laptops?", "f0624be3-94a5-47d5-9ece-23f3f9ff41e8": "How does ChatGPT Canvas's ability to make API requests compare to previous functionalities?", "74bf9d73-67e0-43c4-b5af-5457986d5663": "When did Google release their gemini-20-flash-thinking-exp model?", "225d9984-2601-4ad9-a68c-0693ab8a849c": "What is the license under which Alibaba's QwQ model was released?", "8b78a8fb-1a99-46f1-b1f8-a8f4af3b2a36": "What is the main innovation mentioned in the context regarding model scaling?", "c2c77263-41ca-4e77-8ceb-15f419388e61": "When was the sequel to o1, o3 announced, and what benchmark did it achieve impressive results against?", "3da2e5f3-5ff2-45f6-a63a-8a77d3bca6a5": "What challenges did the author face last year regarding their choice of platform for trying out new models?", "99b63ba7-4574-4166-9759-ce171cb0b147": "How does the author feel about their choice of platform this year compared to last year?", "dea57095-0948-4345-ac6a-3c6939f36b38": "What are some potential consequences of making decisions based on hype and misinformation?", "63dbb087-434a-4406-96ff-313642d2fb83": "Why is it important to acknowledge good applications of certain tools before discussing their implementation?", "33ed5384-878f-414b-9b72-795a179e16e5": "What concerns did @v0's creators have regarding the prompt when it was first released?", "f81e4039-53da-428e-a03f-ea2c411670ce": "How did the approach to handling prompts change after the initial release of @v0?", "a6a37ead-9b8c-4fe5-8511-f06205c927d1": "What is the key principle behind creating effective system prompts according to the context?", "72f13d07-f503-4606-a730-0f76713f0722": "Why is having a strong evaluation suite important for building applications on LLM-powered systems?", "9a50e140-59e3-4dcc-94dc-ec9c052be7fe": "What is the concern regarding AI models feeding on their own output?", "56c0828f-296a-45a5-877b-06ded7b122b6": "How are AI labs addressing the issue of content quality in their training processes?", "23295b77-f0d9-45a6-8e14-a8ac767a1bbf": "What topics were covered in the annotated presentations given in 2023?", "b3b2d979-f2e5-4ea0-8984-5f0396b95e1d": "Which podcasts featured discussions about Large Language Models?", "4e46db47-cf53-4bd9-ba1a-fcb106d1322e": "What are the names of the three best available models that were freely accessible for a few months this year?", "79d647ba-6209-40c1-a639-70a90c64a195": "In what year does the author expect the prompt-driven custom interface feature to be widely adopted in various products?", "228a51c5-a220-4d2e-96f8-af230fee59da": "What was the title of the article that received the highest number of visitors according to the provided analytics?", "0657d22b-87a5-44f0-9e11-caa12e0b9a2c": "How many visitors did the article titled \"Leaked Google document: 'We Have No Moat, And Neither Does OpenAI'\" receive?", "c672aad8-9c3b-4cc6-8c50-5345ff67fdd1": "What new feature was added to Claude's API on August 23rd?", "ec16f800-889d-485e-8eab-13e8eb7a2845": "What was discussed in the weeknotes on September 12th regarding OpenAI?", "3953165a-c364-44f1-b116-23a1ab75951a": "What organizations have produced better-than-GPT-3 class models in the past year?", "25722605-2ffe-4938-882e-49730d12b17e": "How much has the training cost for LLMs decreased from initial estimates?", "9cd7cb5d-0df8-48b3-98fb-854214c3e18d": "What new feature did the Chatbot Arena team introduce in December related to user interaction and model comparison?", "e38eb654-972c-46f9-a00c-f1bcad231d3d": "How is the author planning to utilize prompts in their Datasette project?", "4734a54d-6ad3-4819-b1a1-62e02bbb405a": "What features does Google’s Gemini offer in relation to audio input and output?", "d00518f2-1ba6-4e3c-81b4-6447d33abac8": "When is Amazon's voice mode for Amazon Nova expected to roll out?", "d97fa1d6-ccaf-4bea-b5a6-eaea24d405b1": "How do longer inputs enhance the problem-solving capabilities of an LLM?", "6a699fd3-b764-452a-8a14-bda3393d0b33": "What are some examples of use-cases that benefit from providing long inputs to an LLM?", "da3c0b5d-d442-425a-843b-2d1d58b656b2": "What are the hardware requirements mentioned for running a model like GPT-4?", "49b89b66-40cf-4234-a173-2392cbfd6209": "What does the author attribute the ability to run models like GPT-4 on less powerful hardware to?", "0f09d2e6-e548-4244-aeee-068252a78e0b": "What are the potential environmental impacts of the competitive buildout of infrastructure by major tech companies?", "92ec1374-99dd-4be9-81f7-003136a1432e": "Why might some executives hesitate to argue against the necessity of building new infrastructure for AI models?", "eb8aa118-fe00-4600-90e2-3988ec7cede4": "What tools did the author describe in their writing about Claude Artifacts?", "ee093a42-e242-4dd3-a44e-164b8967b0a8": "How did other teams respond to the author's use of Claude Artifacts?", "08868bad-dd61-453e-ac8e-85c465d496b6": "What analogy is used to describe LLMs in the context provided?", "1ffaf4fa-0300-4131-9ff9-cb12e2d612b4": "What factors influence the effectiveness of LLMs when answering questions?", "baabd0dc-6af7-4cda-b671-8d76db939d18": "What advantages do software engineers have in utilizing coding interns for problem-solving?", "d1e98dd5-d094-43db-a2e9-b05e7bada078": "What ethical concerns are associated with the use of unlicensed training data in machine learning models?", "0f050a5f-32bd-4442-8ab5-b909e1c353fa": "What are the new abilities mentioned in the context, and how long have they been available?", "ace55234-ecd5-4d9d-a701-611d0c0164b8": "How did OpenAI improve its API access for developers in December?", "7d785b55-a5f4-4ffd-a5de-bea2323377fb": "What significant event occurred on Christmas Day related to DeepSeek v3?", "fd81cfbc-3f76-4947-b4ac-099865b4b400": "What paper did Meta publish in December that is relevant to large language models?", "cbbc3b25-9f5f-4816-ad13-ff147edce7d1": "What are some programming languages mentioned in the context that have simpler grammar rules compared to natural languages?", "b5c3fc08-857c-44af-8354-3c772a211194": "What is one of the significant weaknesses of LLMs as described in the context?", "5768dc35-49f2-473a-96d3-bcac57a81fd8": "What is the significance of the \"o\" in the GPT-4o model?", "462c0e29-9b7e-44e8-887e-d08c3f6ec272": "Why did the voice from the demo, named Skye, not make it to a production product?", "da4a5e51-2290-4b1d-a3bd-892cce22b80a": "What improvements were noted in the intonation of ChatGPT Advanced Voice mode during its rollout?", "326fbfbf-4c70-4d49-aecc-77919c8b6587": "How did the user experiment with accents in the Advanced Voice mode?", "1a72075a-5c03-435e-93dc-c5b714d58724": "What is the term coined by the author to describe the issue of manipulating responses from AI systems?", "56228455-25db-4c0d-a166-3add9c769296": "How does the author suggest that users can improve the quality of answers they receive from AI?", "6ffe6a02-6e12-4619-93f6-7bacdfe92c27": "What are some potential applications of Large Language Models (LLMs) mentioned in the context?", "a6b0d036-ba29-4aaf-8493-08a70fadbb1b": "What is identified as the biggest unsolved problem related to LLMs?", "5f8d9e61-f7fd-4d02-9584-d23a4c4e586a": "What significant event occurred in 2024 related to the term \"slop\"?", "81c9aee8-f97d-4142-9a67-0f5e1abf804b": "Who expanded on the tweet by @deepfates regarding the term \"slop\"?", "7b961c67-05a8-456a-9419-02b52ec58197": "What challenges are associated with using LLMs in the year of slop?", "387190ac-5620-4e0a-b907-ee531007350f": "How is knowledge distribution described in relation to LLMs?", "c3e42115-5bd9-4baa-8a4d-d1addae61001": "What is the licensing type of the Qwen25-Coder-32B model?", "d46cf34c-4843-406a-8d5e-0961e3ad9084": "When was Meta’s Llama 33 70B model released?", "28d98b6a-105b-4199-bef6-c8b76b591698": "What colors are the markings on the dark brown/black butterfly in the feeder?", "c83607cb-09f6-4110-b23e-0ab5692d3a26": "What type of fruit is visible inside the shallow dish at the California Academy of Sciences?", "2a6731f8-0219-4218-b0b3-1e82d33735b7": "What unexpected capabilities have been discovered in LLMs that even their trainers did not anticipate?", "5a9ddaa0-e147-465d-adee-cf577c1f91be": "Is there a possibility that ChatGPT's performance is influenced by the time of year, particularly around the holidays?", "1c60f72a-4371-4394-a80d-a4c0b05791e3": "What were the prices for OpenAI's GPT-4, GPT-4 Turbo, and GPT-35 Turbo in December 2023?", "87e8184a-29cf-4e74-a865-3ca647067a85": "How much has the price of OpenAI's GPT-4o model decreased compared to the original GPT-4?", "69197577-feed-45ee-82a8-ebd484fb5c8d": "How does the complexity of relationships between tokens in organic datasets affect a model's learning process?", "f44decf3-a779-4fef-9c95-2ac38903e2a8": "In what way does the prediction of each token by preceding tokens facilitate reasoning for a language model?", "5c96bd70-e142-431f-b217-1fbd0cc21ba5": "What is the significance of Claude Artifacts in the context of LLMs and application development?", "43c31579-22a9-4dc6-8e4d-72fbe5d6c023": "How does Claude enable users to interact with applications created through its interface?", "0c7a352c-cbbb-4af4-9b31-91046ea2ea1f": "What is the total cost to process 68,000 images according to the context?", "be8535ce-e20e-42ea-9ff2-a84feb0b7a11": "Which command was used to obtain descriptions from the image IMG_1825jpeg?", "447c848a-5145-41ec-a9f0-2c28a3b7d20e": "What are the key features of NotebookLM’s automatically generated podcasts that make them effective?", "87b08d32-ce6e-43fd-9bbf-21f03a95854e": "What topics were covered during OpenAI DevDay 2024?", "ef9d5681-988a-47ef-9fa1-d110e971e8f1": "What does the term \"slop\" refer to in the context of AI-generated content?", "e5fd94ec-726c-4ced-9526-2d789c00e4fb": "How does the author compare the terms \"spam\" and \"slop\" in relation to unwanted content?", "1ae5dc16-a1ec-4380-bf6e-915313ed61f5": "What are the two main categories of thought regarding AI agents mentioned in the context?", "e76ea307-1cb8-4bc7-8f72-7e7da1624323": "How does the term \"autonomy\" relate to the discussion of AI agents in the provided context?", "adb5ff4f-e652-4ca7-8f5e-6900dc36ed8c": "What are the two main factors driving the price drops in LLM models according to the context?", "ae6a9eab-d4ce-4c6f-a770-d62a0cb534b4": "How much does Google’s Gemini 15 Flash 8B cost per mTok compared to GPT-35 Turbo from last year?", "87a5c9f3-e683-4188-8f07-a432616d9c4d": "What does the term \"slop\" refer to in the context of generative AI usage?", "dbc1d475-7364-425b-9df4-4317b74b7618": "What is \"model collapse\" and when was it first described?", "b0801da7-d7b7-4732-aae9-a874be7fd3b6": "What are some of the capabilities of Large Language Models (LLMs) mentioned in the context?", "daa84c96-66db-4325-8be5-8d815701fd4e": "What potential negative uses of LLMs are highlighted in the provided context?", "6841bcac-cecd-4a30-b291-6fc127746116": "What challenges do LLMs face in distinguishing truth from fiction?", "ee4f3b79-c386-47cf-a2f7-93cf64fd5cab": "What incident involving Google Search is mentioned in the context?", "fd4d03f0-db26-4619-a54c-60b5b1a34c0a": "What is the name of the model that quickly became the author's favorite daily-driver after its launch in March?", "65caa740-45f7-4944-adb3-0ecba91569b8": "What significant upgrade did Claude 35 Sonnet receive on October 22?", "fb4b77c7-2d35-48b8-9ad4-36463e30d0e5": "What is the mlx-vlm project and how does it relate to vision LLMs on Apple Silicon?", "74b9ca61-d4a3-469f-bbdf-8ff4d3e1463c": "What were the author's initial thoughts on Apple's \"Apple Intelligence\" features following their announcement in June?", "b20e4fc3-dac4-475e-b3ad-26f66bce12cd": "What challenges does the author face when evaluating the strengths and weaknesses of an LLM?", "55d72ba9-cbdb-426a-a458-0a2eb164f723": "How does the author feel about the current state of prompting and its effectiveness in working with LLMs?", "942bb5e7-08f3-47c2-81f5-ee9108cdee1d": "What are some potential societal impacts of the technology mentioned in the context?", "36d89ceb-b1e4-45af-9855-fc225fcc81f7": "Why does the author believe that the knowledge gap between tech enthusiasts and the general population is unhealthy?", "a45a557c-b525-41fe-a28c-1ef31b60088b": "What significant event occurred in February related to Meta and Llama?", "cadb7bfe-03aa-40f4-84cf-61cf1fe5008d": "How did the release of Llama 2 in July differ from the original Llama in terms of commercial use?", "0f89c988-6f7a-4acf-9744-839a2939c87b": "What was the maximum token limit for most models last year before the introduction of Gemini 15 Pro?", "e8dda468-f728-4748-8538-b63e20527180": "How many tokens can Google's Gemini series accept?", "7fcae42c-b6cc-4a2c-81f3-7e89ccfb6ce2": "How does the parameter size of DeepSeek v3 compare to that of Meta's Llama 31 model?", "330b2136-619f-4cf7-a50d-175aee4b01fc": "What is the estimated training cost of DeepSeek v3, and how does it compare to the training hours of Llama 31?", "dd403563-6060-4b63-9a53-d0420d8cef8b": "What notable capabilities were introduced with Google’s Gemini 15 Pro in February?", "179565ba-986a-4190-af10-27c869063174": "How did the author contribute to the Google I/O opening keynote in May?", "8204bf17-b576-4d1e-93c7-1381f1ee1ba9": "How does the ability of ChatGPT to execute and debug code impact the role of software engineers?", "9c1c4049-4e9d-4d7b-b317-bd9f704cf64a": "What are the implications of having a Code Interpreter-like tool for fact-checking natural language?", "abae853a-825b-465f-8499-552073befa36": "What advancements have been made in multimodal vision and audio/video capabilities in LLMs?", "daccd4cb-b6c8-4200-a30e-7010eeabaa84": "How has the competition affected the pricing of LLMs and what impact did it have on universal access to the best models?", "9a3e8190-0e63-4794-bc13-ddf0d3085535": "What new feature was introduced in ChatGPT's voice mode in December?", "f31ac734-3ef5-4a0f-a4a0-58353b4975c9": "How does Google Gemini's recent feature compare to ChatGPT's live video option?", "a9eaf548-b5b0-478c-8ca8-e55f4f5e99ca": "What were some of the financial crashes associated with the construction of railways in the 1800s?", "d7c1c7fc-748a-42ab-8d74-072095430313": "How did the construction of railways in the 1800s impact the environment?", "3df92edc-9432-4b63-86cd-9cc93a7988a3": "What key themes and pivotal moments in the field of Large Language Models were identified in 2024?", "637ba794-c2b7-4d65-af29-134a703bd336": "How does the review of 2024 compare to the previous year's review of 2023?", "46653d26-d6b8-41df-b280-3d55be3ad7ff": "What are embeddings and why are they considered important in the context of LLMs?", "04d6d767-b615-4863-b527-149cc01c960c": "How does the new llamafile improve the process of running an LLM on a personal computer?", "6939aeaa-e5ed-4eb3-b41e-4dbe1178cdd6": "What is the significance of prompt engineering in DALL-E 3?", "b6660902-86c7-4b08-90f4-99c6e9631b80": "How does the vicuna-7b Large Language Model operate in a web browser?", "de120ef4-7f0d-413f-960f-30099143f4e6": "What are some reasons people dislike LLMs according to the context?", "f2044854-2a15-45a0-8313-c0c04f5dc8a6": "Why is it important to discuss the criticisms of LLMs?", "33bd799c-cfa0-4d66-892b-554a57576c73": "What is the role of the Hugging Face Open LLM Leaderboard in the ecosystem of model training and sharing?", "692ab5ba-8837-4938-922d-2398edcfb368": "How do fine-tuned community models compare to foundation models in terms of performance and licensing?", "25c6dc8a-3e6f-468d-be3b-b060acdb0b18": "What challenges do computer scientists and software engineers face when working with large language models (LLMs)?", "b1e172d9-ce2a-457e-8440-b386a1e2957d": "Why is it difficult to evaluate the performance of LLMs according to the context provided?", "5ad5f680-6ed6-4fea-a614-2282549fddab": "What issues arise from end users developing inaccurate mental models of AI systems like ChatGPT?", "8ed9beec-fb62-4a7b-a6c4-b81cca70e8f8": "Why is it considered ludicrous to use a screenshot from ChatGPT as evidence in an argument?", "17d8aafb-b289-4f1d-bcaa-3c91bb2ba7db": "What role does synthetic data play in the pretraining of models, particularly in the Phi series?", "8e46176b-8c11-48db-ac6d-beaeefdf2a7b": "How does synthetic data compare to organic data in terms of advantages?", "e281f92a-6802-48be-9fc6-94e10d344e56": "What are the sizes of Meta's Llama 32 models mentioned in the context?", "c4e4b899-404a-4e87-9e3a-12a9671384cf": "How does the performance of the Llama 32 3B model compare to GPT-4 class models?", "5d7b0291-fdb9-4c31-9e52-f13a5a0106a7": "What are some reasons why better informed people have chosen to avoid using LLMs?", "ccc36899-8350-480e-bb9b-30aad0766aa7": "Why is it important to develop skills for working with inherently unreliable technology like LLMs?", "12b7ff7d-c0a4-4450-b46d-a23f3dcd7d7d": "What is the significance of the numbers associated with blogging, AI, generative AI, and LLMs in the context provided?", "1f406568-9ae4-42c2-91fe-03044beb3b6f": "What might the phrase \"the formidable power of escalating streaks\" refer to in relation to Tom Scott?", "4405101b-5de8-45ee-ad64-ef94899d0484": "What technique is being used by an increasing number of labs to create training data for smaller models?", "e6ac5157-87be-4c58-bf7a-92ce5dd4863e": "How many synthetically generated examples were used in the fine-tuning of Meta’s Llama 33 70B?", "6f45aca2-0a65-46ab-a30c-76adda5db47a": "What significant change occurred in the AI landscape regarding models surpassing GPT-4 in the past twelve months?", "9f4bf1cb-867f-4fda-a725-addbc512730b": "How many organizations currently have models that rank higher than the original GPT-4 on the Chatbot Arena Leaderboard?", "24385f6c-5822-44de-8b11-645cc301e909": "What are the ethical implications of training AI models on individuals' content without their consent?", "fa594dde-61df-41e3-8b32-6d27988b35b9": "How has the increasing quality of AI models affected employment in creative fields such as copywriting, art, and translation?", "4a50b2a4-075e-4f85-89ee-8c2b1eff0d09": "What is the main topic discussed in the article posted on December 31, 2023?", "034f5982-ac7c-4607-944c-7c887e47d619": "When is the next article in the series \"LLMs annual review\" expected to be published?", "f5d25d55-5313-4d42-be43-c2aa2a16ba81": "What significant advancements have been made in AI models since the release of GPT-4 in March?", "6de79699-c4a3-4613-811e-3871eb805a65": "What are the claims made by Google’s Gemini Ultra regarding its capabilities compared to GPT-4?", "fac7bf2f-d059-4bcd-970b-c04880564431": "What is the main subject of the lawsuit launched by the New York Times against OpenAI and Microsoft?", "e18f10b9-6f29-4b9b-bede-eabb4b05e50c": "Why is the first few pages of the 69-page PDF considered particularly valuable for understanding the issues at hand?", "349fbda8-e957-4a17-8bf1-0581e017c279": "What limitations do the models, including OpenAI's o1, still face despite improvements in their capabilities?", "6317c25c-a613-4ff4-82fd-36948c9aace6": "How does the user experience with the default LLM chat UI compare to using a more familiar interface?", "92453d65-8359-423d-baa9-aaffb83f2a2c": "Which organization currently has a higher scoring model than GPT-4-0314 on the Chatbot Arena leaderboard?", "cca2b2f2-c2f3-4203-b732-0108ded575a2": "How has the significance of training a GPT-4 beating model changed from 2023 to 2024?", "f4acbf91-17ec-40ce-a216-b127e47f7c3b": "What significant multi-modal models were released by major vendors in 2024?", "6306b00e-91b8-4b4b-bd86-814fa121da8c": "Which month did OpenAI introduce audio input and output capabilities?", "8e0c4ac0-eb9f-44fd-ba4b-c59d11509d9c": "What comparison does the author make to illustrate the difficulty of training an LLM?", "4dc781be-edc7-49da-8d9f-0adbf3e8d354": "As of January of this year, what was the author's perception of the feasibility of running a useful LLM on personal computers?", "45d15933-11ac-455b-b66a-e8b1c86122f8": "What is the main concept behind the chain-of-thought prompting trick as discussed in the context?", "eb2b6524-9c1c-4d58-8684-a31575d350cb": "How do o1 models differ from traditional models in terms of reasoning and output visibility?", "bb016bad-c8c7-4614-b883-a0f2b99bd334": "What significant advancements in AI were made in 2023, particularly regarding Large Language Models (LLMs)?", "c257e2d4-7488-4837-b550-1957f5dd1014": "How does the development of LLMs in 2023 relate to the historical context of Artificial Intelligence since the 1950s?", "117b6fd4-ada4-4fe0-a1c9-ded4df61d06d": "What is the primary factor that determines the quality of a resulting model when training a system?", "f6c07eaa-a9d5-49f3-8095-cf245edeef6b": "How many lines of Python code are typically sufficient to train a basic version of a powerful system?", "b248f59f-6ebc-4628-89b7-e5dac586f103": "What is the significance of the cost reduction mentioned in the context regarding LLMs in 2024?", "a7573073-c73a-4b1c-9d79-a4eb3bd0aa9f": "How does the emergence of multi-modal LLMs, such as GPT-4 Vision and Google’s Gemini 10, reflect trends in technology for 2024?", "fdec8a78-7799-47bb-8bd7-4b792a460a29": "Why does the author find the term \"agents\" extremely frustrating?", "d13c3572-4a67-4ccd-8200-c72dacc87241": "What issue does the author highlight regarding the communication of information when someone claims to be building \"agents\"?", "dbeda3c7-83c8-424b-a1e8-2aa98b9d6d11": "What are AI agents commonly understood to be, according to the context provided?", "a6ea517b-73e9-4702-8f5e-03f38414a049": "Why does the author believe that gullibility may hinder the development of AI agents?", "fba87545-1e7b-4c05-8166-cb544b9a960e": "Why is it important for language models to be gullible in certain contexts?", "43663a9a-e51f-46e1-b867-bb01421f237a": "What are the potential drawbacks of having an AI personal assistant that believes everything it is told?", "bf8ac811-ee44-4c14-87fc-42d80649f654": "What significant change occurred in May regarding OpenAI's GPT-4o model for users?", "c0be80fe-059a-4946-859c-57fe5a248a8f": "How does the launch of ChatGPT Pro affect access to OpenAI's most capable model compared to previous offerings?", "c7c1cada-2df2-4b4b-b1e6-56513a3641ae": "What are some of the tools that different systems can apply to problems, as mentioned in the context?", "b2e011e7-cc45-4fd6-b547-06cbd94a7d74": "Why is it important to understand CSP and CORS HTTP headers when building a Claude Artifact that interacts with an external API?", "7bed8f7a-c517-476b-9877-4b72585df715": "What advantages does a 64GB Mac have for running models compared to other machines?", "c344522c-2106-49c3-9d45-5f75b1cdfaa5": "How does the mlx-lm Python library enhance the performance of MLX-compatible models on a Mac?", "716adc78-1a33-4909-8d1e-d2200536bec5": "What model of MacBook Pro is being used in the context, and how much storage does it have?", "f8d1c468-7a88-4bdc-af8a-79fe7a346516": "When did the author first run a large language model on their laptop?", "12c54e30-cc09-45c0-8ee4-faa99b608cf6": "What are the limitations of Apple's LLM features compared to frontier LLMs, according to the context?", "6279744e-9f20-4124-82ae-b2ddc8556167": "What notable development in LLM technology occurred in the final quarter of 2024?", "5a7f547a-89c3-479d-8af4-e503e56836c6": "What is the purpose of the new Claude analysis JavaScript code execution tool mentioned on the 24th?", "64b3b3af-ea96-43d5-943a-461a40d84071": "How can users interact with images, audio, and video in their terminal as noted on the 29th?", "7651f883-43fc-40aa-9a07-947ca27d3c22": "How does the energy consumption of individual prompts compare to other activities like driving a car or watching a video on YouTube?", "d7866fb9-7b7a-4eed-a443-4da3f3ec6ed2": "What does the cost of training the DeepSeek v3 model suggest about the future of training costs in machine learning?"}, "relevant_contexts": {"0151eedd-48d2-451c-bb6e-faaf97327a39": ["5341fa2e-4b7f-4736-86eb-0c604deba411"], "d5968e6c-120d-4953-bc5a-bea6a5452746": ["5341fa2e-4b7f-4736-86eb-0c604deba411"], "6f78663f-9c48-4ec7-839a-289346084e0c": ["c580bdca-148a-4c4e-ad59-e5e0d26fd966"], "347ea761-edb3-486d-8669-15a16ef3b439": ["c580bdca-148a-4c4e-ad59-e5e0d26fd966"], "409e618a-b5f0-4165-9e1c-7f86191c119e": ["bfd44496-3406-473c-80d7-69789e13332e"], "8cc9dca6-f10d-46f3-8dfe-90dccf675cf9": ["bfd44496-3406-473c-80d7-69789e13332e"], "56a8709b-b837-4efa-b6ef-c63ecb2e6c48": ["b5f02642-b234-4570-84dc-327dbef260c2"], "f46e4f84-fb8f-4a51-8e53-aed8360d15a5": ["b5f02642-b234-4570-84dc-327dbef260c2"], "fee75ab9-9ea9-4872-ba9f-c095f3723618": ["d3747ab2-52bf-4cd9-997f-29d585a2a04e"], "aca94740-bdb8-46cc-bfaf-30eefdc5d3c0": ["d3747ab2-52bf-4cd9-997f-29d585a2a04e"], "c9b4563c-23fa-4f98-8eba-18c18f4ee718": ["93663f3f-4f01-4ced-a97c-ffbd4d15a95f"], "0b9b1800-01a0-418b-a06d-ed48464df028": ["93663f3f-4f01-4ced-a97c-ffbd4d15a95f"], "6e462cb2-788a-4bca-9ad4-cdaa9e32a476": ["bc0d7bf9-c3e2-4ab0-bb49-d370988a8c5d"], "2da1bcb6-0e78-4254-9660-478fe6888089": ["bc0d7bf9-c3e2-4ab0-bb49-d370988a8c5d"], "919ecc00-5bc9-4abb-8905-75f29bbed7aa": ["d758fa8e-0166-4397-99d0-a90c6bea5310"], "2d2a4f5f-8ffa-433f-b53c-9927255b5d4e": ["d758fa8e-0166-4397-99d0-a90c6bea5310"], "e0fcd1d2-6a94-4fec-8802-b14f46c756ca": ["52d1b016-eb0a-4fbc-aa49-2fde01453412"], "7d9bd05b-399c-4f66-8839-45cb7c66a240": ["52d1b016-eb0a-4fbc-aa49-2fde01453412"], "6c5c7551-3afb-4699-ac7f-f4322d001947": ["469f3f71-913f-406f-9d23-f6b09a85d9e5"], "f0624be3-94a5-47d5-9ece-23f3f9ff41e8": ["469f3f71-913f-406f-9d23-f6b09a85d9e5"], "74bf9d73-67e0-43c4-b5af-5457986d5663": ["acb35371-89cb-4877-a4be-489d30ad0b64"], "225d9984-2601-4ad9-a68c-0693ab8a849c": ["acb35371-89cb-4877-a4be-489d30ad0b64"], "8b78a8fb-1a99-46f1-b1f8-a8f4af3b2a36": ["bf514c5d-ca12-413d-8a6c-a2c2a1623898"], "c2c77263-41ca-4e77-8ceb-15f419388e61": ["bf514c5d-ca12-413d-8a6c-a2c2a1623898"], "3da2e5f3-5ff2-45f6-a63a-8a77d3bca6a5": ["9c4ace71-5a99-45fc-8e68-2bbc60239ea5"], "99b63ba7-4574-4166-9759-ce171cb0b147": ["9c4ace71-5a99-45fc-8e68-2bbc60239ea5"], "dea57095-0948-4345-ac6a-3c6939f36b38": ["ff417854-5a35-40a5-90db-b23eb7215bf5"], "63dbb087-434a-4406-96ff-313642d2fb83": ["ff417854-5a35-40a5-90db-b23eb7215bf5"], "33ed5384-878f-414b-9b72-795a179e16e5": ["26cacaaa-3959-41a5-a9dc-bb842ff8589f"], "f81e4039-53da-428e-a03f-ea2c411670ce": ["26cacaaa-3959-41a5-a9dc-bb842ff8589f"], "a6a37ead-9b8c-4fe5-8511-f06205c927d1": ["f94c0117-70bd-48c7-89b8-aa10d9226215"], "72f13d07-f503-4606-a730-0f76713f0722": ["f94c0117-70bd-48c7-89b8-aa10d9226215"], "9a50e140-59e3-4dcc-94dc-ec9c052be7fe": ["9dc51af4-9dff-4daf-8bbb-a5e9623c9c0b"], "56c0828f-296a-45a5-877b-06ded7b122b6": ["9dc51af4-9dff-4daf-8bbb-a5e9623c9c0b"], "23295b77-f0d9-45a6-8e14-a8ac767a1bbf": ["15fa503d-2cf4-4076-83f8-f6131cb20fe6"], "b3b2d979-f2e5-4ea0-8984-5f0396b95e1d": ["15fa503d-2cf4-4076-83f8-f6131cb20fe6"], "4e46db47-cf53-4bd9-ba1a-fcb106d1322e": ["35160e77-fd29-4d86-a049-9469cf26b9b6"], "79d647ba-6209-40c1-a639-70a90c64a195": ["35160e77-fd29-4d86-a049-9469cf26b9b6"], "228a51c5-a220-4d2e-96f8-af230fee59da": ["18a12f26-6c0e-4750-93c8-c7fa79bc959e"], "0657d22b-87a5-44f0-9e11-caa12e0b9a2c": ["18a12f26-6c0e-4750-93c8-c7fa79bc959e"], "c672aad8-9c3b-4cc6-8c50-5345ff67fdd1": ["f479a9e9-61df-4f9c-8ce7-c7e64756a714"], "ec16f800-889d-485e-8eab-13e8eb7a2845": ["f479a9e9-61df-4f9c-8ce7-c7e64756a714"], "3953165a-c364-44f1-b116-23a1ab75951a": ["2bd9107d-8b05-4c60-8891-5eaca1fd7755"], "25722605-2ffe-4938-882e-49730d12b17e": ["2bd9107d-8b05-4c60-8891-5eaca1fd7755"], "9cd7cb5d-0df8-48b3-98fb-854214c3e18d": ["22ace1a5-8446-4d5e-9367-5fc31896723a"], "e38eb654-972c-46f9-a00c-f1bcad231d3d": ["22ace1a5-8446-4d5e-9367-5fc31896723a"], "4734a54d-6ad3-4819-b1a1-62e02bbb405a": ["808a3bd1-32d9-4a93-8778-6864f96d0838"], "d00518f2-1ba6-4e3c-81b4-6447d33abac8": ["808a3bd1-32d9-4a93-8778-6864f96d0838"], "d97fa1d6-ccaf-4bea-b5a6-eaea24d405b1": ["4198dfa9-6056-496d-a768-3df20543c607"], "6a699fd3-b764-452a-8a14-bda3393d0b33": ["4198dfa9-6056-496d-a768-3df20543c607"], "da3c0b5d-d442-425a-843b-2d1d58b656b2": ["0c3c1560-6950-47ce-b844-7a68fe0fbe9e"], "49b89b66-40cf-4234-a173-2392cbfd6209": ["0c3c1560-6950-47ce-b844-7a68fe0fbe9e"], "0f09d2e6-e548-4244-aeee-068252a78e0b": ["dac451bc-aaf3-4baf-88bb-ac912be56ce6"], "92ec1374-99dd-4be9-81f7-003136a1432e": ["dac451bc-aaf3-4baf-88bb-ac912be56ce6"], "eb8aa118-fe00-4600-90e2-3988ec7cede4": ["7a99a9e0-fcac-4e5d-9c2a-39efdc75c25e"], "ee093a42-e242-4dd3-a44e-164b8967b0a8": ["7a99a9e0-fcac-4e5d-9c2a-39efdc75c25e"], "08868bad-dd61-453e-ac8e-85c465d496b6": ["282ace12-3bdd-462a-909c-b25f209d678c"], "1ffaf4fa-0300-4131-9ff9-cb12e2d612b4": ["282ace12-3bdd-462a-909c-b25f209d678c"], "baabd0dc-6af7-4cda-b671-8d76db939d18": ["a33b02b8-d8ac-4a72-99c8-3ba4e605954c"], "d1e98dd5-d094-43db-a2e9-b05e7bada078": ["a33b02b8-d8ac-4a72-99c8-3ba4e605954c"], "0f050a5f-32bd-4442-8ab5-b909e1c353fa": ["4801a0eb-8269-47aa-9e4f-3c1af2a831e8"], "ace55234-ecd5-4d9d-a701-611d0c0164b8": ["4801a0eb-8269-47aa-9e4f-3c1af2a831e8"], "7d785b55-a5f4-4ffd-a5de-bea2323377fb": ["67923355-a83a-45f3-b10f-7df11a201c36"], "fd81cfbc-3f76-4947-b4ac-099865b4b400": ["67923355-a83a-45f3-b10f-7df11a201c36"], "cbbc3b25-9f5f-4816-ad13-ff147edce7d1": ["bb8f867f-4f60-4155-8d15-b5d9947683cc"], "b5c3fc08-857c-44af-8354-3c772a211194": ["bb8f867f-4f60-4155-8d15-b5d9947683cc"], "5768dc35-49f2-473a-96d3-bcac57a81fd8": ["950aed7f-8c1a-4f41-bbb2-460bc81ea287"], "462c0e29-9b7e-44e8-887e-d08c3f6ec272": ["950aed7f-8c1a-4f41-bbb2-460bc81ea287"], "da4a5e51-2290-4b1d-a3bd-892cce22b80a": ["80c4daab-1f4f-47e7-a6b8-6eb212bbb433"], "326fbfbf-4c70-4d49-aecc-77919c8b6587": ["80c4daab-1f4f-47e7-a6b8-6eb212bbb433"], "1a72075a-5c03-435e-93dc-c5b714d58724": ["30a1ae02-10c7-4581-ae2f-e4b698c0353b"], "56228455-25db-4c0d-a166-3add9c769296": ["30a1ae02-10c7-4581-ae2f-e4b698c0353b"], "6ffe6a02-6e12-4619-93f6-7bacdfe92c27": ["4adb9328-c3e9-498a-a3af-dac2c0468835"], "a6b0d036-ba29-4aaf-8493-08a70fadbb1b": ["4adb9328-c3e9-498a-a3af-dac2c0468835"], "5f8d9e61-f7fd-4d02-9584-d23a4c4e586a": ["2f8213b7-dca4-4cbe-aaec-9cfff9e5cf1c"], "81c9aee8-f97d-4142-9a67-0f5e1abf804b": ["2f8213b7-dca4-4cbe-aaec-9cfff9e5cf1c"], "7b961c67-05a8-456a-9419-02b52ec58197": ["4b8586ff-8352-4f7c-9307-6c7a6d5f01b5"], "387190ac-5620-4e0a-b907-ee531007350f": ["4b8586ff-8352-4f7c-9307-6c7a6d5f01b5"], "c3e42115-5bd9-4baa-8a4d-d1addae61001": ["5d90c7e1-b678-4de0-895b-09d4d9c3098b"], "d46cf34c-4843-406a-8d5e-0961e3ad9084": ["5d90c7e1-b678-4de0-895b-09d4d9c3098b"], "28d98b6a-105b-4199-bef6-c8b76b591698": ["50396023-bd8d-4de4-bdd5-a1dd8b759e11"], "c83607cb-09f6-4110-b23e-0ab5692d3a26": ["50396023-bd8d-4de4-bdd5-a1dd8b759e11"], "2a6731f8-0219-4218-b0b3-1e82d33735b7": ["91d46ed0-12cf-47d7-9ae2-22647dd70add"], "5a9ddaa0-e147-465d-adee-cf577c1f91be": ["91d46ed0-12cf-47d7-9ae2-22647dd70add"], "1c60f72a-4371-4394-a80d-a4c0b05791e3": ["cb3db564-5cca-4639-8b3c-4c809d626d3d"], "87e8184a-29cf-4e74-a865-3ca647067a85": ["cb3db564-5cca-4639-8b3c-4c809d626d3d"], "69197577-feed-45ee-82a8-ebd484fb5c8d": ["0837288e-e470-439a-903a-e37c66009da8"], "f44decf3-a779-4fef-9c95-2ac38903e2a8": ["0837288e-e470-439a-903a-e37c66009da8"], "5c96bd70-e142-431f-b217-1fbd0cc21ba5": ["6c7eddbd-ac96-4b9c-8476-0962153e4927"], "43c31579-22a9-4dc6-8e4d-72fbe5d6c023": ["6c7eddbd-ac96-4b9c-8476-0962153e4927"], "0c7a352c-cbbb-4af4-9b31-91046ea2ea1f": ["07443f7e-8fa4-41e6-bcb1-3378c0aaebc3"], "be8535ce-e20e-42ea-9ff2-a84feb0b7a11": ["07443f7e-8fa4-41e6-bcb1-3378c0aaebc3"], "447c848a-5145-41ec-a9f0-2c28a3b7d20e": ["557a2e4d-f436-41ee-adfa-2dbcd0d7f347"], "87b08d32-ce6e-43fd-9bbf-21f03a95854e": ["557a2e4d-f436-41ee-adfa-2dbcd0d7f347"], "ef9d5681-988a-47ef-9fa1-d110e971e8f1": ["69d3d453-3471-4b06-9dfd-aa0f1cdcaec3"], "e5fd94ec-726c-4ced-9526-2d789c00e4fb": ["69d3d453-3471-4b06-9dfd-aa0f1cdcaec3"], "1ae5dc16-a1ec-4380-bf6e-915313ed61f5": ["ea7f7775-6eaf-4e31-a815-fc3bcae74448"], "e76ea307-1cb8-4bc7-8f72-7e7da1624323": ["ea7f7775-6eaf-4e31-a815-fc3bcae74448"], "adb5ff4f-e652-4ca7-8f5e-6900dc36ed8c": ["2bc4b42e-1d7d-4736-b3c3-30755c42ddb6"], "ae6a9eab-d4ce-4c6f-a770-d62a0cb534b4": ["2bc4b42e-1d7d-4736-b3c3-30755c42ddb6"], "87a5c9f3-e683-4188-8f07-a432616d9c4d": ["044fa0e1-a4f7-4a02-beb3-739c57dcbf58"], "dbc1d475-7364-425b-9df4-4317b74b7618": ["044fa0e1-a4f7-4a02-beb3-739c57dcbf58"], "b0801da7-d7b7-4732-aae9-a874be7fd3b6": ["443f465c-3fd3-45cb-b54f-e99c8e5de6dd"], "daa84c96-66db-4325-8be5-8d815701fd4e": ["443f465c-3fd3-45cb-b54f-e99c8e5de6dd"], "6841bcac-cecd-4a30-b291-6fc127746116": ["35916f67-bbec-40e4-ba4c-6ff5ac632741"], "ee4f3b79-c386-47cf-a2f7-93cf64fd5cab": ["35916f67-bbec-40e4-ba4c-6ff5ac632741"], "fd4d03f0-db26-4619-a54c-60b5b1a34c0a": ["573e226d-0deb-4792-9611-491abbecf178"], "65caa740-45f7-4944-adb3-0ecba91569b8": ["573e226d-0deb-4792-9611-491abbecf178"], "fb4b77c7-2d35-48b8-9ad4-36463e30d0e5": ["f61e5943-4fb6-4b76-b3b7-c40a792c3359"], "74b9ca61-d4a3-469f-bbdf-8ff4d3e1463c": ["f61e5943-4fb6-4b76-b3b7-c40a792c3359"], "b20e4fc3-dac4-475e-b3ad-26f66bce12cd": ["f8fddf4d-0828-40ff-b669-1d6f4ebf3740"], "55d72ba9-cbdb-426a-a458-0a2eb164f723": ["f8fddf4d-0828-40ff-b669-1d6f4ebf3740"], "942bb5e7-08f3-47c2-81f5-ee9108cdee1d": ["04d1c8e9-0531-4c17-8f30-9059f52bdde5"], "36d89ceb-b1e4-45af-9855-fc225fcc81f7": ["04d1c8e9-0531-4c17-8f30-9059f52bdde5"], "a45a557c-b525-41fe-a28c-1ef31b60088b": ["51e15c09-8c77-46bf-9313-b911980141bd"], "cadb7bfe-03aa-40f4-84cf-61cf1fe5008d": ["51e15c09-8c77-46bf-9313-b911980141bd"], "0f89c988-6f7a-4acf-9744-839a2939c87b": ["b98aa3ce-9404-4b6d-9204-364dbdae720f"], "e8dda468-f728-4748-8538-b63e20527180": ["b98aa3ce-9404-4b6d-9204-364dbdae720f"], "7fcae42c-b6cc-4a2c-81f3-7e89ccfb6ce2": ["25fc49e8-02d7-45f8-8bde-475764171734"], "330b2136-619f-4cf7-a50d-175aee4b01fc": ["25fc49e8-02d7-45f8-8bde-475764171734"], "dd403563-6060-4b63-9a53-d0420d8cef8b": ["720682de-3f96-4c15-ab4d-24e310f7180b"], "179565ba-986a-4190-af10-27c869063174": ["720682de-3f96-4c15-ab4d-24e310f7180b"], "8204bf17-b576-4d1e-93c7-1381f1ee1ba9": ["58bcd94c-6938-4864-b0e2-d9024516bbd9"], "9c1c4049-4e9d-4d7b-b317-bd9f704cf64a": ["58bcd94c-6938-4864-b0e2-d9024516bbd9"], "abae853a-825b-465f-8499-552073befa36": ["a4f6e336-115b-44df-bb01-321cea780f8c"], "daccd4cb-b6c8-4200-a30e-7010eeabaa84": ["a4f6e336-115b-44df-bb01-321cea780f8c"], "9a3e8190-0e63-4794-bc13-ddf0d3085535": ["9be22c6f-4b0e-45da-ba4a-0c4ed1730ff3"], "f31ac734-3ef5-4a0f-a4a0-58353b4975c9": ["9be22c6f-4b0e-45da-ba4a-0c4ed1730ff3"], "a9eaf548-b5b0-478c-8ca8-e55f4f5e99ca": ["0c5cd872-8ce5-4981-a041-118c718b4da7"], "d7c1c7fc-748a-42ab-8d74-072095430313": ["0c5cd872-8ce5-4981-a041-118c718b4da7"], "3df92edc-9432-4b63-86cd-9cc93a7988a3": ["5088e12c-ee85-428b-b011-2514017aa777"], "637ba794-c2b7-4d65-af29-134a703bd336": ["5088e12c-ee85-428b-b011-2514017aa777"], "46653d26-d6b8-41df-b280-3d55be3ad7ff": ["fe2b2abd-6336-457d-bfe1-bff81ab34e91"], "04d6d767-b615-4863-b527-149cc01c960c": ["fe2b2abd-6336-457d-bfe1-bff81ab34e91"], "6939aeaa-e5ed-4eb3-b41e-4dbe1178cdd6": ["061e61d2-94c0-4a9d-9617-d0accc1f7049"], "b6660902-86c7-4b08-90f4-99c6e9631b80": ["061e61d2-94c0-4a9d-9617-d0accc1f7049"], "de120ef4-7f0d-413f-960f-30099143f4e6": ["3b1f6b05-f589-41b3-b6e7-e9e29a5fdf27"], "f2044854-2a15-45a0-8313-c0c04f5dc8a6": ["3b1f6b05-f589-41b3-b6e7-e9e29a5fdf27"], "33bd799c-cfa0-4d66-892b-554a57576c73": ["fdde7cfd-f9b1-4629-b5e6-a7e128cf2361"], "692ab5ba-8837-4938-922d-2398edcfb368": ["fdde7cfd-f9b1-4629-b5e6-a7e128cf2361"], "25c6dc8a-3e6f-468d-be3b-b060acdb0b18": ["cd8bc9fd-7ee9-4dc0-a8fd-06d07d5c18b9"], "b1e172d9-ce2a-457e-8440-b386a1e2957d": ["cd8bc9fd-7ee9-4dc0-a8fd-06d07d5c18b9"], "5ad5f680-6ed6-4fea-a614-2282549fddab": ["e04e197d-596f-4983-b92f-e85397dbfccc"], "8ed9beec-fb62-4a7b-a6c4-b81cca70e8f8": ["e04e197d-596f-4983-b92f-e85397dbfccc"], "17d8aafb-b289-4f1d-bcaa-3c91bb2ba7db": ["8c9a1eb2-cd0e-49e6-abca-f7938d0726df"], "8e46176b-8c11-48db-ac6d-beaeefdf2a7b": ["8c9a1eb2-cd0e-49e6-abca-f7938d0726df"], "e281f92a-6802-48be-9fc6-94e10d344e56": ["2013cebc-931f-4053-9ffb-92654a1b9a54"], "c4e4b899-404a-4e87-9e3a-12a9671384cf": ["2013cebc-931f-4053-9ffb-92654a1b9a54"], "5d7b0291-fdb9-4c31-9e52-f13a5a0106a7": ["be45f780-02ea-46a7-942c-ba4011ed6090"], "ccc36899-8350-480e-bb9b-30aad0766aa7": ["be45f780-02ea-46a7-942c-ba4011ed6090"], "12b7ff7d-c0a4-4450-b46d-a23f3dcd7d7d": ["eaf0a636-284d-4a97-8aab-c925dbc35607"], "1f406568-9ae4-42c2-91fe-03044beb3b6f": ["eaf0a636-284d-4a97-8aab-c925dbc35607"], "4405101b-5de8-45ee-ad64-ef94899d0484": ["62c7a258-8d30-4ed3-92c9-79e82d120b96"], "e6ac5157-87be-4c58-bf7a-92ce5dd4863e": ["62c7a258-8d30-4ed3-92c9-79e82d120b96"], "6f45aca2-0a65-46ab-a30c-76adda5db47a": ["63ed336a-0484-419a-933c-351e65a95a11"], "9f4bf1cb-867f-4fda-a725-addbc512730b": ["63ed336a-0484-419a-933c-351e65a95a11"], "24385f6c-5822-44de-8b11-645cc301e909": ["0db55714-c14c-4930-9416-40b21dd4b425"], "fa594dde-61df-41e3-8b32-6d27988b35b9": ["0db55714-c14c-4930-9416-40b21dd4b425"], "4a50b2a4-075e-4f85-89ee-8c2b1eff0d09": ["3ec169d3-6f29-47df-a2bc-335f686f3718"], "034f5982-ac7c-4607-944c-7c887e47d619": ["3ec169d3-6f29-47df-a2bc-335f686f3718"], "f5d25d55-5313-4d42-be43-c2aa2a16ba81": ["f79314e2-d4c9-4924-8ae3-7f9080f211f2"], "6de79699-c4a3-4613-811e-3871eb805a65": ["f79314e2-d4c9-4924-8ae3-7f9080f211f2"], "fac7bf2f-d059-4bcd-970b-c04880564431": ["8293a7f8-4dc9-40ac-9012-137c6752bba5"], "e18f10b9-6f29-4b9b-bede-eabb4b05e50c": ["8293a7f8-4dc9-40ac-9012-137c6752bba5"], "349fbda8-e957-4a17-8bf1-0581e017c279": ["61ceea7f-e016-427e-a80b-7369e1fe9edd"], "6317c25c-a613-4ff4-82fd-36948c9aace6": ["61ceea7f-e016-427e-a80b-7369e1fe9edd"], "92453d65-8359-423d-baa9-aaffb83f2a2c": ["a582a27f-6b31-4ae1-92eb-2ebe80965a2a"], "cca2b2f2-c2f3-4203-b732-0108ded575a2": ["a582a27f-6b31-4ae1-92eb-2ebe80965a2a"], "f4acbf91-17ec-40ce-a216-b127e47f7c3b": ["bd3c5306-0d16-42d2-8673-5db1cf6b4366"], "6306b00e-91b8-4b4b-bd86-814fa121da8c": ["bd3c5306-0d16-42d2-8673-5db1cf6b4366"], "8e0c4ac0-eb9f-44fd-ba4b-c59d11509d9c": ["dcfff171-2c45-4539-8e99-e6b9f789d1ad"], "4dc781be-edc7-49da-8d9f-0adbf3e8d354": ["dcfff171-2c45-4539-8e99-e6b9f789d1ad"], "45d15933-11ac-455b-b66a-e8b1c86122f8": ["55543808-a44a-4f5e-be42-85c6f94898dd"], "eb2b6524-9c1c-4d58-8684-a31575d350cb": ["55543808-a44a-4f5e-be42-85c6f94898dd"], "bb016bad-c8c7-4614-b883-a0f2b99bd334": ["f09bb01c-5a7b-44a1-99dd-2837b6aaca4c"], "c257e2d4-7488-4837-b550-1957f5dd1014": ["f09bb01c-5a7b-44a1-99dd-2837b6aaca4c"], "117b6fd4-ada4-4fe0-a1c9-ded4df61d06d": ["9bd1771c-4adc-41a7-aa18-76743430db82"], "f6c07eaa-a9d5-49f3-8095-cf245edeef6b": ["9bd1771c-4adc-41a7-aa18-76743430db82"], "b248f59f-6ebc-4628-89b7-e5dac586f103": ["e61b7534-8af6-4514-88e1-78f8462fcefe"], "a7573073-c73a-4b1c-9d79-a4eb3bd0aa9f": ["e61b7534-8af6-4514-88e1-78f8462fcefe"], "fdec8a78-7799-47bb-8bd7-4b792a460a29": ["a0ef29fc-f8b5-4416-8fba-af6ade45fbba"], "d13c3572-4a67-4ccd-8200-c72dacc87241": ["a0ef29fc-f8b5-4416-8fba-af6ade45fbba"], "dbeda3c7-83c8-424b-a1e8-2aa98b9d6d11": ["1e7da394-d6ce-4c18-b586-4f0940294eb9"], "a6ea517b-73e9-4702-8f5e-03f38414a049": ["1e7da394-d6ce-4c18-b586-4f0940294eb9"], "fba87545-1e7b-4c05-8166-cb544b9a960e": ["b3fc9afd-b203-40a2-8ce8-2703a6719ac1"], "43663a9a-e51f-46e1-b867-bb01421f237a": ["b3fc9afd-b203-40a2-8ce8-2703a6719ac1"], "bf8ac811-ee44-4c14-87fc-42d80649f654": ["848b7a95-92b7-4559-b2e9-6b41f4f73d08"], "c0be80fe-059a-4946-859c-57fe5a248a8f": ["848b7a95-92b7-4559-b2e9-6b41f4f73d08"], "c7c1cada-2df2-4b4b-b1e6-56513a3641ae": ["8c4a125a-a6a6-45ab-8b66-5d04da953cb2"], "b2e011e7-cc45-4fd6-b547-06cbd94a7d74": ["8c4a125a-a6a6-45ab-8b66-5d04da953cb2"], "7bed8f7a-c517-476b-9877-4b72585df715": ["b3c4645f-29b5-4f73-9e4b-47ea05f7ca58"], "c344522c-2106-49c3-9d45-5f75b1cdfaa5": ["b3c4645f-29b5-4f73-9e4b-47ea05f7ca58"], "716adc78-1a33-4909-8d1e-d2200536bec5": ["39abc23e-a97f-4b24-9f10-ee9ac68444b7"], "f8d1c468-7a88-4bdc-af8a-79fe7a346516": ["39abc23e-a97f-4b24-9f10-ee9ac68444b7"], "12c54e30-cc09-45c0-8ee4-faa99b608cf6": ["27088b7b-bd5f-4027-b46f-ccf8afd9da69"], "6279744e-9f20-4124-82ae-b2ddc8556167": ["27088b7b-bd5f-4027-b46f-ccf8afd9da69"], "5a7f547a-89c3-479d-8af4-e503e56836c6": ["18dd5065-c287-4393-9d6e-d08d20c21e9c"], "64b3b3af-ea96-43d5-943a-461a40d84071": ["18dd5065-c287-4393-9d6e-d08d20c21e9c"], "7651f883-43fc-40aa-9a07-947ca27d3c22": ["6624d56f-673c-4ccf-a11f-ed0afe8ec87e"], "d7866fb9-7b7a-4eed-a443-4da3f3ec6ed2": ["6624d56f-673c-4ccf-a11f-ed0afe8ec87e"]}, "corpus": {"f09bb01c-5a7b-44a1-99dd-2837b6aaca4c": "Stuff we figured out about AI in 2023\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSimon Willison’s Weblog\nSubscribe\n\n\n\n\n\n\nStuff we figured out about AI in 2023\n31st December 2023\n2023 was the breakthrough year for Large Language Models (LLMs). I think it’s OK to call these AI—they’re the latest and (currently) most interesting development in the academic field of Artificial Intelligence that dates back to the 1950s.\nHere’s my attempt to round up the highlights in one place!", "4adb9328-c3e9-498a-a3af-dac2c0468835": "Large Language Models\nThey’re actually quite easy to build\nYou can run LLMs on your own devices\nHobbyists can build their own fine-tuned models\nWe don’t yet know how to build GPT-4\nVibes Based Development\nLLMs are really smart, and also really, really dumb\nGullibility is the biggest unsolved problem\nCode may be the best application\nThe ethics of this space remain diabolically complex\nMy blog in 2023", "443f465c-3fd3-45cb-b54f-e99c8e5de6dd": "Here’s the sequel to this post: Things we learned about LLMs in 2024.\nLarge Language Models\nIn the past 24-36 months, our species has discovered that you can take a GIANT corpus of text, run it through a pile of GPUs, and use it to create a fascinating new kind of software.\nLLMs can do a lot of things. They can answer questions, summarize documents, translate from one language to another, extract information and even write surprisingly competent code.\nThey can also help you cheat at your homework, generate unlimited streams of fake content and be used for all manner of nefarious purposes.", "b5f02642-b234-4570-84dc-327dbef260c2": "So far, I think they’re a net positive. I’ve used them on a personal level to improve my productivity (and entertain myself) in all sorts of different ways. I think people who learn how to use them effectively can gain a significant boost to their quality of life.\nA lot of people are yet to be sold on their value! Some think their negatives outweigh their positives, some think they are all hot air, and some even think they represent an existential threat to humanity.\nThey’re actually quite easy to build\nThe most surprising thing we’ve learned about LLMs this year is that they’re actually quite easy to build.", "9bd1771c-4adc-41a7-aa18-76743430db82": "Intuitively, one would expect that systems this powerful would take millions of lines of complex code. Instead, it turns out a few hundred lines of Python is genuinely enough to train a basic version!\nWhat matters most is the training  data. You need a lot of data to make these things work, and the quantity and quality of the training data appears to be the most important factor in how good the resulting model is.\nIf you can gather the right data, and afford to pay for the GPUs to train it, you can build an LLM.", "2bd9107d-8b05-4c60-8891-5eaca1fd7755": "A year ago, the only organization that had released a generally useful LLM was OpenAI. We’ve now seen better-than-GPT-3 class models produced by Anthropic, Mistral, Google, Meta, EleutherAI, Stability AI, TII in Abu Dhabi (Falcon), Microsoft Research, xAI, Replit, Baidu and a bunch of other organizations.\nThe training cost (hardware and electricity) is still significant—initially millions of dollars, but that seems to have dropped to the tens of thousands already. Microsoft’s Phi-2 claims to have used “14 days on 96 A100 GPUs”, which works out at around $35,000 using current Lambda pricing.", "dcfff171-2c45-4539-8e99-e6b9f789d1ad": "So training an LLM still isn’t something a hobbyist can afford, but it’s no longer the sole domain of the super-rich. I like to compare the difficulty of training an LLM to that of building a suspension bridge—not trivial, but hundreds of countries around the world have figured out how to do it. (Correction: Wikipedia’s Suspension bridges by country category lists 44 countries).\nYou can run LLMs on your own devices\nIn January of this year, I thought it would be years before I could run a useful LLM on my own computer. GPT-3 and 3.5 were pretty much the only games in town, and I thought that even if the model weights were available it would take a $10,000+ server to run them.", "51e15c09-8c77-46bf-9313-b911980141bd": "Then in February, Meta released Llama. And a few weeks later in March, Georgi Gerganov released code that got it working on a MacBook.\nI wrote about how Large language models are having their Stable Diffusion moment, and with hindsight that was a very good call!\nThis unleashed a whirlwind of innovation, which was accelerated further in July when Meta released Llama 2—an improved version which, crucially, included permission for commercial use.\nToday there are literally thousands of LLMs that can be run locally, on all manner of different devices.", "c580bdca-148a-4c4e-ad59-e5e0d26fd966": "I run a bunch of them on my laptop. I run Mistral 7B (a surprisingly great model) on my iPhone. You can install several different apps to get your own, local, completely private LLM. My own LLM project provides a CLI tool for running an array of different models via plugins.\nYou can even run them entirely in your browser using WebAssembly and the latest Chrome!\nHobbyists can build their own fine-tuned models\nI said earlier that building an LLM was still out of reach of hobbyists. That may be true for training from scratch, but fine-tuning one of those models is another matter entirely.", "fdde7cfd-f9b1-4629-b5e6-a7e128cf2361": "There’s now a fascinating ecosystem of people training their own models on top of these foundations, publishing those models, building fine-tuning datasets and sharing those too.\nThe Hugging Face Open LLM Leaderboard is one place that tracks these. I can’t even attempt to count them, and any count would be out-of-date within a few hours.\nThe best overall openly licensed LLM at any time is rarely a foundation model: instead, it’s whichever fine-tuned community model has most recently discovered the best combination of fine-tuning data.\nThis is a huge advantage for open over closed models: the closed, hosted models don’t have thousands of researchers and hobbyists around the world collaborating and competing to improve them.", "f79314e2-d4c9-4924-8ae3-7f9080f211f2": "We don’t yet know how to build GPT-4\nFrustratingly, despite the enormous leaps ahead we’ve had this year, we are yet to see an alternative model that’s better than GPT-4.\nOpenAI released GPT-4 in March, though it later turned out we had a sneak peak of it in February when Microsoft used it as part of the new Bing.\nThis may well change in the next few weeks: Google’s Gemini Ultra has big claims, but isn’t yet available for us to try out.\nThe team behind Mistral are working to beat GPT-4 as well, and their track record is already extremely strong considering their first public model only came out in September, and they’ve released two significant improvements since then.", "cd8bc9fd-7ee9-4dc0-a8fd-06d07d5c18b9": "Still, I’m surprised that no-one has beaten the now almost year old GPT-4 by now. OpenAI clearly have some substantial tricks that they haven’t shared yet.\nVibes Based Development\nAs a computer scientist and software engineer, LLMs are infuriating.\nEven the openly licensed ones are still the world’s most convoluted black boxes. We continue to have very little idea what they can do, how exactly they work and how best to control them.\nI’m used to programming where the computer does exactly what I tell it to do. Prompting an LLM is decidedly not that!\nThe worst part is the challenge of evaluating them.\nThere are plenty of benchmarks, but no benchmark is going to tell you if an LLM actually “feels” right when you try it for a given task.", "f8fddf4d-0828-40ff-b669-1d6f4ebf3740": "I find I have to work with an LLM for a few weeks in order to get a good intuition for it’s strengths and weaknesses. This greatly limits how many I can evaluate myself!\nThe most frustrating thing for me is at the level of individual prompting.\nSometimes I’ll tweak a prompt and capitalize some of the words in it, to emphasize that I really want it to OUTPUT VALID MARKDOWN or similar. Did capitalizing those words make a difference? I still don’t have a good methodology for figuring that out.\nWe’re left with what’s effectively Vibes Based Development. It’s vibes all the way down.\nI’d love to see us move beyond vibes in 2024!\nLLMs are really smart, and also really, really dumb", "91d46ed0-12cf-47d7-9ae2-22647dd70add": "On the one hand, we keep on finding new things that LLMs can do that we didn’t expect—and that the people who trained the models didn’t expect either. That’s usually really fun!\nBut on the other hand, the things you sometimes have to do to get the models to behave are often incredibly dumb.\nDoes ChatGPT get lazy in December, because its hidden system prompt includes the current date and its training data shows that people provide less useful answers coming up to the holidays?\nThe honest answer is “maybe”! No-one is entirely sure, but if you give it a different date its answers may skew slightly longer.", "30a1ae02-10c7-4581-ae2f-e4b698c0353b": "Sometimes it omits sections of code and leaves you to fill them in, but if you tell it you can’t type because you don’t have any fingers it produces the full code for you instead.\nThere are so many more examples like this. Offer it cash tips for better answers. Tell it your career depends on it. Give it positive reinforcement. It’s all so dumb, but it works!\nGullibility is the biggest unsolved problem\nI coined the term prompt injection in September last year.\n15 months later, I regret to say that we’re still no closer to a robust, dependable solution to this problem.\nI’ve written a ton about this already.\nBeyond that specific class of security vulnerabilities, I’ve started seeing this as a wider problem of gullibility.", "b3fc9afd-b203-40a2-8ce8-2703a6719ac1": "Language Models are gullible. They “believe” what we tell them—what’s in their training data, then what’s in the fine-tuning data, then what’s in the prompt.\nIn order to be useful tools for us, we need them to believe what we feed them!\nBut it turns out a lot of the things we want to build need them not to be gullible.\nEveryone wants an AI personal assistant. If you hired a real-world personal assistant who believed everything that anyone told them, you would quickly find that their ability to positively impact your life was severely limited.", "1e7da394-d6ce-4c18-b586-4f0940294eb9": "A lot of people are excited about AI agents—an infuriatingly vague term that seems to be converging on “AI systems that can go away and act on your behalf”. We’ve been talking about them all year, but I’ve seen few if any examples of them running in production, despite lots of exciting prototypes.\nI think this is because of gullibility.\nCan we solve this? Honestly, I’m beginning to suspect that you can’t fully solve gullibility without achieving AGI. So it may be quite a while before those agent dreams can really start to come true!\nCode may be the best application\nOver the course of the year, it’s become increasingly clear that writing code is one of the things LLMs are most capable of.", "bb8f867f-4f60-4155-8d15-b5d9947683cc": "If you think about what they do, this isn’t such a big surprise. The grammar rules of programming languages like Python and JavaScript are massively less complicated than the grammar of Chinese, Spanish or English.\nIt’s still astonishing to me how effective they are though.\nOne of the great weaknesses of LLMs is their tendency to hallucinate—to imagine things that don’t correspond to reality. You would expect this to be a particularly bad problem for code—if an LLM hallucinates a method that doesn’t exist, the code should be useless.", "58bcd94c-6938-4864-b0e2-d9024516bbd9": "Except... you can run generated code to see if it’s correct. And with patterns like ChatGPT Code Interpreter the LLM can execute the code itself, process the error message, then rewrite it and keep trying until it works!\nSo hallucination is a much lesser problem for code generation than for anything else. If only we had the equivalent of Code Interpreter for fact-checking natural language!\nHow should we feel about this as software engineers?\nOn the one hand, this feels like a threat: who needs a programmer if ChatGPT can write code for you?", "a33b02b8-d8ac-4a72-99c8-3ba4e605954c": "On the other hand, as software engineers we are better placed to take advantage of this than anyone else. We’ve all been given weird coding interns—we can use our deep knowledge to prompt them to solve coding problems more effectively than anyone else can.\nThe ethics of this space remain diabolically complex\nIn September last year Andy Baio and I produced the first major story on the unlicensed training data behind Stable Diffusion.\nSince then, almost every major LLM (and most of the image generation models) have also been trained on unlicensed data.", "8293a7f8-4dc9-40ac-9012-137c6752bba5": "Just this week, the New York Times launched a landmark lawsuit against OpenAI and Microsoft over this issue. The 69 page PDF is genuinely worth reading—especially the first few pages, which lay out the issues in a way that’s surprisingly easy to follow. The rest of the document includes some of the clearest explanations of what LLMs are, how they work and how they are built that I’ve read anywhere.\nThe legal arguments here are complex. I’m not a lawyer, but I don’t think this one will be easily decided. Whichever way it goes, I expect this case to have a profound impact on how this technology develops in the future.", "0db55714-c14c-4930-9416-40b21dd4b425": "Law is not ethics. Is it OK to train models on people’s content without their permission, when those models will then be used in ways that compete with those people?\nAs the quality of results produced by AI models has increased over the year, these questions have become even more pressing.\nThe impact on human society in terms of these models is already huge, if difficult to objectively measure.\nPeople have certainly lost work to them—anecdotally, I’ve seen this for copywriters, artists and translators.\nThere are a great deal of untold stories here. I’m hoping 2024 sees significant amounts of dedicated journalism on this topic.\nMy blog in 2023\nHere’s a tag cloud for content I posted to my blog in 2023 (generated using Django SQL Dashboard):", "18a12f26-6c0e-4750-93c8-c7fa79bc959e": "The top five: ai (342), generativeai (300), llms (287), openai (86), chatgpt (78).\nI’ve written a lot about this stuff!\nI grabbed a screenshot of my Plausible analytics for the year, fed that to ChatGPT Vision, told it to extract the data into a table, then got it to mix in entry titles (from a SQL query it wrote) and produced this table with it. Here are my top entries this year by amount of traffic:\n\n\n\nArticle\nVisitors\nPageviews\n\n\n\n\nBing: “I will not harm you unless you harm me first”\n1.1M\n1.3M\n\n\nLeaked Google document: “We Have No Moat, And Neither Does OpenAI”\n132k\n162k\n\n\nLarge language models are having their Stable Diffusion moment\n121k\n150k\n\n\nPrompt injection: What’s the worst that can happen?\n79.8k\n95.9k", "fe2b2abd-6336-457d-bfe1-bff81ab34e91": "Embeddings: What they are and why they matter\n61.7k\n79.3k\n\n\nCatching up on the weird world of LLMs\n61.6k\n85.9k\n\n\nllamafile is the new best way to run an LLM on your own computer\n52k\n66k\n\n\nPrompt injection explained, with video, slides, and a transcript\n51k\n61.9k\n\n\nAI-enhanced development makes me more ambitious with my projects\n49.6k\n60.1k\n\n\nUnderstanding GPT tokenizers\n49.5k\n61.1k\n\n\nExploring GPTs: ChatGPT in a trench coat?\n46.4k\n58.5k\n\n\nCould you train a ChatGPT-beating model for $85,000 and run it in a browser?\n40.5k\n49.2k\n\n\nHow to implement Q&A against your documentation with GPT3, embeddings and Datasette\n37.3k\n44.9k\n\n\nLawyer cites fake cases invented by ChatGPT, judge is not amused\n37.1k\n47.4k", "061e61d2-94c0-4a9d-9617-d0accc1f7049": "Now add a walrus: Prompt engineering in DALL-E 3\n32.8k\n41.2k\n\n\nWeb LLM runs the vicuna-7b Large Language Model entirely in your browser, and it’s very impressive\n32.5k\n38.2k\n\n\nChatGPT can’t access the internet, even though it really looks like it can\n30.5k\n34.2k\n\n\nStanford Alpaca, and the acceleration of on-device large language model development\n29.7k\n35.7k\n\n\nRun Llama 2 on your own Mac using LLM and Homebrew\n27.9k\n33.6k\n\n\nMidjourney 5.1\n26.7k\n33.4k\n\n\nThink of language models like ChatGPT as a “calculator for words”\n25k\n31.8k\n\n\nMulti-modal prompt injection image attacks against GPT-4V\n23.7k\n27.4k", "15fa503d-2cf4-4076-83f8-f6131cb20fe6": "I also gave a bunch of talks and podcast appearances. I’ve started habitually turning my talks into annotated presentations—here are my best from 2023:\n\nPrompt injection explained, with video, slides, and a transcript\nCatching up on the weird world of LLMs\nMaking Large Language Models work for you\nOpen questions for AI engineering\nEmbeddings: What they are and why they matter\nFinancial sustainability for open source projects at GitHub Universe\n\nAnd in podcasts:\n\n\nWhat AI can do for you on the Theory of Change\n\nWorking in public on Path to Citus Con\n\nLLMs break the internet on the Changelog\n\nTalking Large Language Models on Rooftop Ruby\n\nThoughts on the OpenAI board situation on Newsroom Robots", "3ec169d3-6f29-47df-a2bc-335f686f3718": "Industry’s Tardy Response to the AI Prompt Injection Vulnerability on RedMonk Conversations\n\n\nPosted 31st December 2023 at 11:59 pm · Follow me on Mastodon or Twitter or subscribe to my newsletter\n\n\nMore recent articles\n\nRun LLMs on macOS using llm-mlx and Apple's MLX framework - 15th February 2025\nURL-addressable Pyodide Python environments - 13th February 2025\nUsing pip to install a Large Language Model that's under 100MB - 7th February 2025\n\n\n \n\n\nThis is Stuff we figured out about AI in 2023 by Simon Willison, posted on 31st December 2023.\n\nPart of series LLMs annual review\n\nStuff we figured out about AI in 2023 - Dec. 31, 2023, 11:59 p.m. \nThings we learned about LLMs in 2024 - Dec. 31, 2024, 6:07 p.m.", "eaf0a636-284d-4a97-8aab-c925dbc35607": "blogging\n            68\n\n\n            ai\n            1098\n\n\n            generative-ai\n            942\n\n\n            llms\n            930\n\nNext: Tom Scott, and the formidable power of escalating streaks\nPrevious: Last weeknotes of 2023\n\n\n \n \n\n\nColophon\n©\n2002\n2003\n2004\n2005\n2006\n2007\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019\n2020\n2021\n2022\n2023\n2024\n2025", "5088e12c-ee85-428b-b011-2514017aa777": "Things we learned about LLMs in 2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSimon Willison’s Weblog\nSubscribe\n\n\n\n\n\n\nThings we learned about LLMs in 2024\n31st December 2024\nA lot has happened in the world of Large Language Models over the course of 2024. Here’s a review of things we figured out about the field in the past twelve months, plus my attempt at identifying key themes and pivotal moments.\nThis is a sequel to my review of 2023.\nIn this article:", "a4f6e336-115b-44df-bb01-321cea780f8c": "The GPT-4 barrier was comprehensively broken\nSome of those GPT-4 models run on my laptop\nLLM prices crashed, thanks to competition and increased efficiency\nMultimodal vision is common, audio and video are starting to emerge\nVoice and live camera mode are science fiction come to life\nPrompt driven app generation is a commodity already\nUniversal access to the best models lasted for just a few short months\n“Agents” still haven’t really happened yet\nEvals really matter\nApple Intelligence is bad, Apple’s MLX library is excellent\nThe rise of inference-scaling “reasoning” models\nWas the best currently available LLM trained in China for less than $6m?\nThe environmental impact got better\nThe environmental impact got much, much worse", "4b8586ff-8352-4f7c-9307-6c7a6d5f01b5": "The year of slop\nSynthetic training data works great\nLLMs somehow got even harder to use\nKnowledge is incredibly unevenly distributed\nLLMs need better criticism\nEverything tagged “llms” on my blog in 2024", "63ed336a-0484-419a-933c-351e65a95a11": "The GPT-4 barrier was comprehensively broken\nIn my December 2023 review I wrote about how We don’t yet know how to build GPT-4—OpenAI’s best model was almost a year old at that point, yet no other AI lab had produced anything better. What did OpenAI know that the rest of us didn’t?\nI’m relieved that this has changed completely in the past twelve months. 18 organizations now have models on the Chatbot Arena Leaderboard that rank higher than the original GPT-4 from March 2023 (GPT-4-0314 on the board)—70 models in total.", "720682de-3f96-4c15-ab4d-24e310f7180b": "The earliest of those was Google’s Gemini 1.5 Pro, released in February. In addition to producing GPT-4 level outputs, it introduced several brand new capabilities to the field—most notably its 1 million (and then later 2 million) token input context length, and the ability to input video.\nI wrote about this at the time in The killer app of Gemini Pro 1.5 is video, which earned me a short appearance as a talking head in the Google I/O opening keynote in May.", "b98aa3ce-9404-4b6d-9204-364dbdae720f": "Gemini 1.5 Pro also illustrated one of the key themes of 2024: increased context lengths. Last year most models accepted 4,096 or 8,192 tokens, with the notable exception of Claude 2.1 which accepted 200,000. Today every serious provider has a 100,000+ token model, and Google’s Gemini series accepts up to 2 million.", "4198dfa9-6056-496d-a768-3df20543c607": "Longer inputs dramatically increase the scope of problems that can be solved with an LLM: you can now throw in an entire book and ask questions about its contents, but more importantly you can feed in a lot of example code to help the model correctly solve a coding problem. LLM use-cases that involve long inputs are far more interesting to me than short prompts that rely purely on the information already baked into the model weights. Many of my tools were built using this pattern.", "573e226d-0deb-4792-9611-491abbecf178": "Getting back to models that beat GPT-4: Anthropic’s Claude 3 series launched in March, and Claude 3 Opus quickly became my new favourite daily-driver. They upped the ante even more in June with the launch of Claude 3.5 Sonnet—a model that is still my favourite six months later (though it got a significant upgrade on October 22, confusingly keeping the same 3.5 version number. Anthropic fans have since taken to calling it Claude 3.6).", "a582a27f-6b31-4ae1-92eb-2ebe80965a2a": "Then there’s the rest. If you browse the Chatbot Arena leaderboard today—still the most useful single place to get a vibes-based evaluation of models—you’ll see that GPT-4-0314 has fallen to around 70th place. The 18 organizations with higher scoring models are Google, OpenAI, Alibaba, Anthropic, Meta, Reka AI, 01 AI, Amazon, Cohere, DeepSeek, Nvidia, Mistral, NexusFlow, Zhipu AI, xAI, AI21 Labs, Princeton and Tencent.\nTraining a GPT-4 beating model was a huge deal in 2023. In 2024 it’s an achievement that isn’t even particularly notable, though I personally still celebrate any time a new organization joins that list.\nSome of those GPT-4 models run on my laptop", "39abc23e-a97f-4b24-9f10-ee9ac68444b7": "My personal laptop is a 64GB M2 MacBook Pro from 2023. It’s a powerful machine, but it’s also nearly two years old now—and crucially it’s the same laptop I’ve been using ever since I first ran an LLM on my computer back in March 2023 (see Large language models are having their Stable Diffusion moment).\nThat same laptop that could just about run a GPT-3-class model in March last year has now run multiple GPT-4 class models! Some of my notes on that:", "5d90c7e1-b678-4de0-895b-09d4d9c3098b": "Qwen2.5-Coder-32B is an LLM that can code well that runs on my Mac talks about Qwen2.5-Coder-32B in November—an Apache 2.0 licensed model!\n\nI can now run a GPT-4 class model on my laptop talks about running Meta’s Llama 3.3 70B (released in December)", "0c3c1560-6950-47ce-b844-7a68fe0fbe9e": "This remains astonishing to me. I thought a model with the capabilities and output quality of GPT-4 needed a datacenter class server with one or more $40,000+ GPUs.\nThese models take up enough of my 64GB of RAM that I don’t run them often—they don’t leave much room for anything else.\nThe fact that they run at all is a testament to the incredible training and inference performance gains that we’ve figured out over the past year. It turns out there was a lot of low-hanging fruit to be harvested in terms of model efficiency. I expect there’s still more to come.", "2013cebc-931f-4053-9ffb-92654a1b9a54": "Meta’s Llama 3.2 models deserve a special mention. They may not be GPT-4 class, but at 1B and 3B sizes they punch massively above their weight. I run Llama 3.2 3B on my iPhone using the free MLC Chat iOS app and it’s a shockingly capable model for its tiny (<2GB) size. Try firing it up and asking it for “a plot outline of a Netflix Christmas movie where a data journalist falls in love with a local ceramacist”. Here’s what I got, at a respectable 20 tokens per second:", "cb3db564-5cca-4639-8b3c-4c809d626d3d": "Here’s the rest of the transcript. It’s bland and generic, but my phone can pitch bland and generic Christmas movies to Netflix now!\nLLM prices crashed, thanks to competition and increased efficiency\nThe past twelve months have seen a dramatic collapse in the cost of running a prompt through the top tier hosted LLMs.\nIn December 2023 (here’s the Internet Archive for the OpenAI pricing page) OpenAI were charging $30/million input tokens for GPT-4, $10/mTok for the then-new GPT-4 Turbo and $1/mTok for GPT-3.5 Turbo.\nToday $30/mTok gets you OpenAI’s most expensive model, o1. GPT-4o is $2.50 (12x cheaper than GPT-4) and GPT-4o mini is $0.15/mTok—nearly 7x cheaper than GPT-3.5 and massively more capable.", "2bc4b42e-1d7d-4736-b3c3-30755c42ddb6": "Other model providers charge even less. Anthropic’s Claude 3 Haiku (from March, but still their cheapest model) is $0.25/mTok. Google’s Gemini 1.5 Flash is $0.075/mTok and their Gemini 1.5 Flash 8B is $0.0375/mTok—that’s 27x cheaper than GPT-3.5 Turbo last year.\nI’ve been tracking these pricing changes under my llm-pricing tag.\nThese price drops are driven by two factors: increased competition and increased efficiency. The efficiency thing is really important for everyone who is concerned about the environmental impact of LLMs. These price drops tie directly to how much energy is being used for running prompts.", "52d1b016-eb0a-4fbc-aa49-2fde01453412": "There’s still plenty to worry about with respect to the environmental impact of the great AI datacenter buildout, but a lot of the concerns over the energy cost of individual prompts are no longer credible.\nHere’s a fun napkin calculation: how much would it cost to generate short descriptions of every one of the 68,000 photos in my personal photo library using Google’s Gemini 1.5 Flash 8B (released in October), their cheapest model?\nEach photo would need 260 input tokens and around 100 output tokens.\n260 * 68,000 = 17,680,000 input tokens\n17,680,000 * $0.0375/million = $0.66\n100 * 68,000 = 6,800,000 output tokens\n6,800,000 * $0.15/million = $1.02", "07443f7e-8fa4-41e6-bcb1-3378c0aaebc3": "That’s a total cost of $1.68 to process 68,000 images. That’s so absurdly cheap I had to run the numbers three times to confirm I got it right.\nHow good are those descriptions? Here’s what I got from this command:\nllm -m gemini-1.5-flash-8b-latest describe -a IMG_1825.jpeg", "50396023-bd8d-4de4-bdd5-a1dd8b759e11": "Against this photo of butterflies at the California Academy of Sciences:\n\n\nA shallow dish, likely a hummingbird or butterfly feeder, is red.  Pieces of orange slices of fruit are visible inside the dish.\nTwo butterflies are positioned in the feeder, one is a dark brown/black butterfly with white/cream-colored markings.  The other is a large, brown butterfly with patterns of lighter brown, beige, and black markings, including prominent eye spots. The larger brown butterfly appears to be feeding on the fruit.", "e61b7534-8af6-4514-88e1-78f8462fcefe": "260 input tokens, 92 output tokens. Cost approximately 0.0024 cents (that’s less than a 400th of a cent).\nThis increase in efficiency and reduction in price is my single favourite trend from 2024. I want the utility of LLMs at a fraction of the energy cost and it looks like that’s what we’re getting.\nMultimodal vision is common, audio and video are starting to emerge\nMy butterfly example above illustrates another key trend from 2024: the rise of multi-modal LLMs.\nA year ago the single most notable example of these was GPT-4 Vision, released at OpenAI’s DevDay in November 2023. Google’s multi-modal Gemini 1.0 was announced on December 7th 2023 so it also (just) makes it into the 2023 window.", "bd3c5306-0d16-42d2-8673-5db1cf6b4366": "In 2024, almost every significant model vendor released multi-modal models. We saw the Claude 3 series from Anthropic in March, Gemini 1.5 Pro in April (images, audio and video), then September brought Qwen2-VL and Mistral’s Pixtral 12B and Meta’s Llama 3.2 11B and 90B vision models. We got audio input and output from OpenAI in October, then November saw SmolVLM from Hugging Face and December saw image and video models from Amazon Nova.\nIn October I upgraded my LLM CLI tool to support multi-modal models via attachments. It now has plugins for a whole collection of different vision models.", "bc0d7bf9-c3e2-4ab0-bb49-d370988a8c5d": "I think people who complain that LLM improvement has slowed are often missing the enormous advances in these multi-modal models. Being able to run prompts against images (and audio and video) is a fascinating new way to apply these models.\nVoice and live camera mode are science fiction come to life\nThe audio and live video modes that have started to emerge deserve a special mention.\nThe ability to talk to ChatGPT first arrived in September 2023, but it was mostly an illusion: OpenAI used their excellent Whisper speech-to-text model and a new text-to-speech model (creatively named tts-1) to enable conversations with the ChatGPT mobile apps, but the actual model just saw text.", "950aed7f-8c1a-4f41-bbb2-460bc81ea287": "The May 13th announcement of GPT-4o included a demo of a brand new voice mode, where the true multi-modal GPT-4o (the o is for “omni”) model could accept audio input and output incredibly realistic sounding speech without needing separate TTS or STT models.\nThe demo also sounded conspicuously similar to Scarlett Johansson... and after she complained the voice from the demo, Skye, never made it to a production product.\nThe delay in releasing the new voice mode after the initial demo caused quite a lot of confusion. I wrote about that in ChatGPT in “4o” mode is not running the new features yet.", "80c4daab-1f4f-47e7-a6b8-6eb212bbb433": "When ChatGPT Advanced Voice mode finally did roll out (a slow roll from August through September) it was spectacular. I’ve been using it extensively on walks with my dog and it’s amazing how much the improvement in intonation elevates the material. I’ve also had a lot of fun experimenting with the OpenAI audio APIs.\nEven more fun: Advanced Voice mode can do accents! Here’s what happened when I told it I need you to pretend to be a California brown pelican with a very thick Russian accent, but you talk to me exclusively in Spanish.", "808a3bd1-32d9-4a93-8778-6864f96d0838": "Your browser does not support the audio element.\n\nOpenAI aren’t the only group with a multi-modal audio model. Google’s Gemini also accepts audio input, and the Google Gemini apps can speak in a similar way to ChatGPT now. Amazon also pre-announced voice mode for Amazon Nova, but that’s meant to roll out in Q1 of 2025.\nGoogle’s NotebookLM, released in September, took audio output to a new level by producing spookily realistic conversations between two “podcast hosts” about anything you fed into their tool. They later added custom instructions, so naturally I turned them into pelicans:\n\n\nYour browser does not support the audio element.", "9be22c6f-4b0e-45da-ba4a-0c4ed1730ff3": "The most recent twist, again from December (December was a lot) is live video. ChatGPT voice mode now provides the option to share your camera feed with the model and talk about what you can see in real time. Google Gemini have a preview of the same feature, which they managed to ship the day before ChatGPT did.", "4801a0eb-8269-47aa-9e4f-3c1af2a831e8": "These abilities are just a few weeks old at this point, and I don’t think their impact has been fully felt yet. If you haven’t tried them out yet you really should.\nBoth Gemini and OpenAI offer API access to these features as well. OpenAI started with a WebSocket API that was quite challenging to use, but in December they announced a new WebRTC API which is much easier to get started with. Building a web app that a user can talk to via voice is easy now!\nPrompt driven app generation is a commodity already\nThis was possible with GPT-4 in 2023, but the value it provides became evident in 2024.", "6c7eddbd-ac96-4b9c-8476-0962153e4927": "We already knew LLMs were spookily good at writing code. If you prompt them right, it turns out they can build you a full interactive application using HTML, CSS and JavaScript (and tools like React if you wire up some extra supporting build mechanisms)—often in a single prompt.\nAnthropic kicked this idea into high gear when they released Claude Artifacts, a groundbreaking new feature that was initially slightly lost in the noise due to being described half way through their announcement of the incredible Claude 3.5 Sonnet.\nWith Artifacts, Claude can write you an on-demand interactive application and then let you use it directly inside the Claude interface.\nHere’s my Extract URLs app, entirely generated by Claude:", "7a99a9e0-fcac-4e5d-9c2a-39efdc75c25e": "I’ve found myself using this a lot. I noticed how much I was relying on it in October and wrote Everything I built with Claude Artifacts this week, describing 14 little tools I had put together in a seven day period.\nSince then, a whole bunch of other teams have built similar systems. GitHub announced their version of this—GitHub Spark—in October. Mistral Chat added it as a feature called Canvas in November.\nSteve Krouse from Val Town built a version of it against Cerebras, showcasing how a 2,000 token/second LLM can iterate on an application with changes visible in less than a second.", "22ace1a5-8446-4d5e-9367-5fc31896723a": "Then in December, the Chatbot Arena team introduced a whole new leaderboard for this feature, driven by users building the same interactive app twice with two different models and voting on the answer. Hard to come up with a more convincing argument that this feature is now a commodity that can be effectively implemented against all of the leading models.\nI’ve been tinkering with a version of this myself for my Datasette project, with the goal of letting users use prompts to build and iterate on custom widgets and data visualizations against their own data. I also figured out a similar pattern for writing one-shot Python programs, enabled by uv.", "35160e77-fd29-4d86-a049-9469cf26b9b6": "This prompt-driven custom interface feature is so powerful and easy to build (once you’ve figured out the gnarly details of browser sandboxing) that I expect it to show up as a feature in a wide range of products in 2025.\nUniversal access to the best models lasted for just a few short months\nFor a few short months this year all three of the best available models—GPT-4o, Claude 3.5 Sonnet and Gemini 1.5 Pro—were freely available to most of the world.", "848b7a95-92b7-4559-b2e9-6b41f4f73d08": "OpenAI made GPT-4o free for all users in May, and Claude 3.5 Sonnet was freely available from its launch in June. This was a momentus change, because for the previous year free users had mostly been restricted to GPT-3.5 level models, meaning new users got a very inaccurate mental model of what a capable LLM could actually do.\nThat era appears to have ended, likely permanently, with OpenAI’s launch of ChatGPT Pro. This $200/month subscription service is the only way to access their most capable model, o1 Pro.\nSince the trick behind the o1 series (and the future models it will undoubtedly inspire) is to expend more compute time to get better results, I don’t think those days of free access to the best available models are likely to return.", "a0ef29fc-f8b5-4416-8fba-af6ade45fbba": "“Agents” still haven’t really happened yet\nI find the term “agents” extremely frustrating. It lacks a single, clear and widely understood meaning... but the people who use the term never seem to acknowledge that.\nIf you tell me that you are building “agents”, you’ve conveyed almost no information to me at all. Without reading your mind I have no way of telling which of the dozens of possible definitions you are talking about.", "ea7f7775-6eaf-4e31-a815-fc3bcae74448": "The two main categories I see are people who think AI agents are obviously things that go and act on your behalf—the travel agent model—and people who think in terms of LLMs that have been given access to tools which they can run in a loop as part of solving a problem. The term “autonomy” is often thrown into the mix too, again without including a clear definition.\n(I also collected 211 definitions on Twitter a few months ago—here they are in Datasette Lite—and had gemini-exp-1206 attempt to summarize them.)\nWhatever the term may mean, agents still have that feeling of perpetually “coming soon”.", "35916f67-bbec-40e4-ba4c-6ff5ac632741": "Terminology aside, I remain skeptical as to their utility based, once again, on the challenge of gullibility. LLMs believe anything you tell them. Any systems that attempts to make meaningful decisions on your behalf will run into the same roadblock: how good is a travel agent, or a digital assistant, or even a research tool if it can’t distinguish truth from fiction?\nJust the other day Google Search was caught serving up an entirely fake description of the non-existant movie “Encanto 2”. It turned out to be summarizing an imagined movie listing from a fan fiction wiki.", "bfd44496-3406-473c-80d7-69789e13332e": "Prompt injection is a natural consequence of this gulibility. I’ve seen precious little progress on tackling that problem in 2024, and we’ve been talking about it since September 2022.\nI’m beginning to see the most popular idea of “agents” as dependent on AGI itself. A model that’s robust against gulliblity is a very tall order indeed.\nEvals really matter\nAnthropic’s Amanda Askell (responsible for much of the work behind Claude’s Character):", "f94c0117-70bd-48c7-89b8-aa10d9226215": "The boring yet crucial secret behind good system prompts is test-driven development. You don’t write down a system prompt and find ways to test it. You write down tests and find a system prompt that passes them.\n\nIt’s become abundantly clear over the course of 2024 that writing good automated evals for LLM-powered systems is the skill that’s most needed to build useful applications on top of these models. If you have a strong eval suite you can adopt new models faster, iterate better and build more reliable and useful product features than your competition.\nVercel’s Malte Ubl:", "26cacaaa-3959-41a5-a9dc-bb842ff8589f": "When @v0 first came out we were paranoid about protecting the prompt with all kinds of pre and post processing complexity.\nWe completely pivoted to let it rip. A prompt without the evals, models, and especially UX is like getting a broken ASML machine without a manual", "9c4ace71-5a99-45fc-8e68-2bbc60239ea5": "I’m still trying to figure out the best patterns for doing this for my own work. Everyone knows that evals are important, but there remains a lack of great guidance for how to best implement them—I’m tracking this under my evals tag. My SVG pelican riding a bicycle benchmark is a pale imitation of what a real eval suite should look like.\nApple Intelligence is bad, Apple’s MLX library is excellent\nAs a Mac user I’ve been feeling a lot better about my choice of platform this year.\nLast year it felt like my lack of a Linux/Windows  machine with an NVIDIA GPU was a huge disadvantage in terms of trying out new models.", "b3c4645f-29b5-4f73-9e4b-47ea05f7ca58": "On paper, a 64GB Mac should be a great machine for running models due to the way the CPU and GPU can share the same memory. In practice, many models are released as model weights and libraries that reward NVIDIA’s CUDA over other platforms.\nThe llama.cpp ecosystem helped a lot here, but the real breakthrough has been Apple’s MLX library, “an array framework for Apple Silicon”. It’s fantastic.\nApple’s mlx-lm Python library supports running a wide range of MLX-compatible models on my Mac, with excellent performance. mlx-community on Hugging Face offers more than 1,000 models that have been converted to the necessary format.", "f61e5943-4fb6-4b76-b3b7-c40a792c3359": "Prince Canuma’s excellent, fast moving mlx-vlm project brings vision LLMs to Apple Silicon as well. I used that recently to run Qwen’s QvQ.\nWhile MLX is a game changer, Apple’s own “Apple Intelligence” features have mostly been a disappointment. I wrote about their initial announcement in June, and I was optimistic that Apple had focused hard on the subset of LLM applications that preserve user privacy and minimize the chance of users getting mislead by confusing features.", "27088b7b-bd5f-4027-b46f-ccf8afd9da69": "Now that those features are rolling out they’re pretty weak. As an LLM power-user I know what these models are capable of, and Apple’s LLM features offer a pale imitation of what a frontier LLM can do. Instead we’re getting notification summaries that misrepresent news headlines and writing assistant tools that I’ve not found useful at all. Genmoji are kind of fun though.\nThe rise of inference-scaling “reasoning” models\nThe most interesting development in the final quarter of 2024 was the introduction of a new shape of LLM, exemplified by OpenAI’s o1 models—initially released as o1-preview and o1-mini on September 12th.", "55543808-a44a-4f5e-be42-85c6f94898dd": "One way to think about these models is an extension of the chain-of-thought prompting trick, first explored in the May 2022 paper Large Language Models are Zero-Shot Reasoners.\nThis is that trick where, if you get a model to talk out loud about a problem it’s solving, you often get a result which the model would not have achieved otherwise.\no1 takes this process and further bakes it into the model itself. The details are somewhat obfuscated: o1 models spend “reasoning tokens” thinking through the problem that are not directly visible to the user (though the ChatGPT UI shows a summary of them), then outputs a final result.", "bf514c5d-ca12-413d-8a6c-a2c2a1623898": "The biggest innovation here is that it opens up a new way to scale a model: instead of improving model performance purely through additional compute at training time, models can now take on harder problems by spending more compute on inference.\nThe sequel to o1, o3 (they skipped “o2” for European trademark reasons) was announced on 20th December with an impressive result against the ARC-AGI benchmark, albeit one that likely involved more than $1,000,000 of compute time expense!\no3 is expected to ship in January. I doubt many people have real-world problems that would benefit from that level of compute expenditure—I certainly don’t!—but it appears to be a genuine next step in LLM architecture for taking on much harder problems.", "acb35371-89cb-4877-a4be-489d30ad0b64": "OpenAI are not the only game in town here. Google released their first entrant in the category, gemini-2.0-flash-thinking-exp, on December 19th.\nAlibaba’s Qwen team released their QwQ model on November 28th—under an Apache 2.0 license, and that one I could run on my own machine. They followed that up with a vision reasoning model called QvQ on December 24th, which I also ran locally.\nDeepSeek made their DeepSeek-R1-Lite-Preview model available to try out through their chat interface on November 20th.\nTo understand more about inference scaling I recommend Is AI progress slowing down? by Arvind Narayanan and Sayash Kapoor.", "67923355-a83a-45f3-b10f-7df11a201c36": "Nothing yet from Anthropic or Meta but I would be very surprised if they don’t have their own inference-scaling models in the works. Meta published a relevant paper Training Large Language Models to Reason in a Continuous Latent Space in December.\nWas the best currently available LLM trained in China for less than $6m?\nNot quite, but almost! It does make for a great attention-grabbing headline.\nThe big news to end the year was the release of DeepSeek v3—dropped on Hugging Face on Christmas Day without so much as a README file, then followed by documentation and a paper the day after that.", "25fc49e8-02d7-45f8-8bde-475764171734": "DeepSeek v3 is a huge 685B parameter model—one of the largest openly licensed models currently available, significantly bigger than the largest of Meta’s Llama series, Llama 3.1 405B.\nBenchmarks put it up there with Claude 3.5 Sonnet. Vibe benchmarks (aka the Chatbot Arena) currently rank it 7th, just behind the Gemini 2.0 and OpenAI 4o/o1 models. This is by far the highest ranking openly licensed model.\nThe really impressive thing about DeepSeek v3 is the training cost. The model was trained on 2,788,000 H800 GPU hours at an estimated cost of $5,576,000. Llama 3.1 405B trained 30,840,000 GPU hours—11x that used by DeepSeek v3, for a model that benchmarks slightly worse.", "d758fa8e-0166-4397-99d0-a90c6bea5310": "Those US export regulations on GPUs to China seem to have inspired some very effective training optimizations!\nThe environmental impact got better\nA welcome result of the increased efficiency of the models—both the hosted ones and the ones I can run locally—is that the energy usage and environmental impact of running a prompt has dropped enormously over the past couple of years.\nOpenAI themselves are charging 100x less for a prompt compared to the GPT-3 days. I have it on good authority that neither Google Gemini nor Amazon Nova (two of the least expensive model providers) are running prompts at a loss.", "6624d56f-673c-4ccf-a11f-ed0afe8ec87e": "I think this means that, as individual users, we don’t need to feel any guilt at all for the energy consumed by the vast majority of our prompts. The impact is likely neglible compared to driving a car down the street or maybe even watching a video on YouTube.\nLikewise, training. DeepSeek v3 training for less than $6m is a fantastic sign that training costs can and should continue to drop.\nFor less efficient models I find it useful to compare their energy usage to commercial flights. The largest Llama 3 model cost about the same as a single digit number of fully loaded passenger flights from New York to London. That’s certainly not nothing, but once trained that model can be used by millions of people at no extra training cost.", "dac451bc-aaf3-4baf-88bb-ac912be56ce6": "The environmental impact got much, much worse\nThe much bigger problem here is the enormous competitive buildout of the infrastructure that is imagined to be necessary for these models in the future.\nCompanies like Google, Meta, Microsoft and Amazon are all spending billions of dollars rolling out new datacenters, with a very material impact on the electricity grid and the environment. There’s even talk of spinning up new nuclear power stations, but those can take decades.\nIs this infrastructure necessary? DeepSeek v3’s $6m training cost and the continued crash in LLM prices might hint that it’s not. But would you want to be the big tech executive that argued NOT to build out this infrastructure only to be proven wrong in a few years’ time?", "0c5cd872-8ce5-4981-a041-118c718b4da7": "An interesting point of comparison here could be the way railways rolled out around the world in the 1800s. Constructing these required enormous investments and had a massive environmental impact, and many of the lines that were built turned out to be unnecessary—sometimes multiple lines from different companies serving the exact same routes!\nThe resulting bubbles contributed to several financial crashes, see Wikipedia for Panic of 1873, Panic of 1893, Panic of 1901 and the UK’s Railway Mania. They left us with a lot of useful infrastructure and a great deal of bankruptcies and environmental damage.\nThe year of slop", "2f8213b7-dca4-4cbe-aaec-9cfff9e5cf1c": "The year of slop\n2024 was the year that the word \"slop\" became a term of art. I wrote about this in May, expanding on this tweet by @deepfates:", "69d3d453-3471-4b06-9dfd-aa0f1cdcaec3": "Watching in real time as “slop” becomes a term of art. the way that “spam” became the term for unwanted emails, “slop” is going in the dictionary as the term for unwanted AI generated content\n\nI expanded that definition a tiny bit to this:\n\nSlop describes AI-generated content that is both unrequested and unreviewed.\n\nI ended up getting quoted talking about slop in both the Guardian and the NY Times. Here’s what I said in the NY TImes:\n\nSociety needs concise ways to talk about modern A.I. — both the positives and the negatives. ‘Ignore that email, it’s spam,’ and ‘Ignore that article, it’s slop,’ are both useful lessons.", "044fa0e1-a4f7-4a02-beb3-739c57dcbf58": "I love the term “slop” because it so succinctly captures one of the ways we should not be using generative AI!\nSlop was even in the running for Oxford Word of the Year 2024, but it lost to brain rot.\nSynthetic training data works great\nAn idea that surprisingly seems to have stuck in the public consciousness is that of “model collapse”. This was first described in the paper The Curse of Recursion: Training on Generated Data Makes Models Forget in May 2023, and repeated in Nature in July 2024 with the more eye-catching headline AI models collapse when trained on recursively generated data.", "9dc51af4-9dff-4daf-8bbb-a5e9623c9c0b": "The idea is seductive: as the internet floods with AI-generated slop the models themselves will degenerate, feeding on their own output in a way that leads to their inevitable demise!\nThat’s clearly not happening. Instead, we are seeing AI labs increasingly train on synthetic content—deliberately creating artificial data to help steer their models in the right way.\nOne of the best descriptions I’ve seen of this comes from the Phi-4 technical report, which included this:", "8c9a1eb2-cd0e-49e6-abca-f7938d0726df": "Synthetic data as a substantial component of pretraining is becoming increasingly common, and the Phi series of models has consistently emphasized the importance of synthetic data. Rather than serving as a cheap substitute for organic data, synthetic data has several direct advantages over organic data.", "0837288e-e470-439a-903a-e37c66009da8": "Structured and Gradual Learning. In organic datasets, the relationship between tokens is often complex and indirect. Many reasoning steps may be required to connect the current token to the next, making it challenging for the model to learn effectively from next-token prediction. By contrast, each token generated by a language model is by definition predicted by the preceding tokens, making it easier for a model to follow the resulting reasoning patterns.", "62c7a258-8d30-4ed3-92c9-79e82d120b96": "Another common technique is to use larger models to help create training data for their smaller, cheaper alternatives—a trick used by an increasing number of labs. DeepSeek v3 used “reasoning” data created by DeepSeek-R1. Meta’s Llama 3.3 70B fine-tuning used over 25M synthetically generated examples.\nCareful design of the training data that goes into an LLM appears to be the entire game for creating these models. The days of just grabbing a full scrape of the web and indiscriminately dumping it into a training run are long gone.\nLLMs somehow got even harder to use", "282ace12-3bdd-462a-909c-b25f209d678c": "A drum I’ve been banging for a while is that LLMs are power-user tools—they’re chainsaws disguised as kitchen knives. They look deceptively simple to use—how hard can it be to type messages to a chatbot?—but in reality you need a huge depth of both understanding and experience to make the most of them and avoid their many pitfalls.\nIf anything, this problem got worse in 2024.\nWe’ve built computer systems you can talk to in human language, that will answer your questions and usually get them right! ... depending on the question, and how you ask it, and whether it’s accurately reflected in the undocumented and secret training set.", "8c4a125a-a6a6-45ab-8b66-5d04da953cb2": "The number of available systems has exploded. Different systems have different tools they can apply to your problems—like Python and JavaScript and web search and image generation and maybe even database lookups... so you’d better understand what those tools are, what they can do and how to tell if the LLM used them or not.\nDid you know ChatGPT has two entirely different ways of running Python now?\nWant to build a Claude Artifact that talks to an external API? You’d better understand CSP and CORS HTTP headers first.", "61ceea7f-e016-427e-a80b-7369e1fe9edd": "The models may have got more capable, but most of the limitations remained the same. OpenAI’s o1 may finally be able to (mostly) count the Rs in strawberry, but its abilities are still limited by its nature as an LLM and the constraints placed on it by the harness it’s running in. o1 can’t run web searches or use Code Interpreter, but GPT-4o can—both in that same ChatGPT UI. (o1 will pretend to do those things if you ask it to, a regression to the URL hallucinations bug from early 2023).\nWhat are we doing about this? Not much. Most users are thrown in at the deep end. The default LLM chat UI is like taking brand new computer users, dropping them into a Linux terminal and expecting them to figure it all out.", "e04e197d-596f-4983-b92f-e85397dbfccc": "Meanwhile, it’s increasingly common for end users to develop wildly inaccurate mental models of how these things work and what they are capable of. I’ve seen so many examples of people trying to win an argument with a screenshot from ChatGPT—an inherently ludicrous proposition, given the inherent unreliability of these models crossed with the fact that you can get them to say anything if you prompt them right.", "be45f780-02ea-46a7-942c-ba4011ed6090": "There’s a flipside to this too: a lot of better informed people have sworn off LLMs entirely because they can’t see how anyone could benefit from a tool with so many flaws. The key skill in getting the most out of LLMs is learning to work with tech that is both inherently unreliable and incredibly powerful at the same time. This is a decidedly non-obvious skill to acquire!\nThere is so much space for helpful education content here, but we need to do do a lot better than outsourcing it all to AI grifters with bombastic Twitter threads.\nKnowledge is incredibly unevenly distributed\nMost people have heard of ChatGPT by now. How many have heard of Claude?", "04d1c8e9-0531-4c17-8f30-9059f52bdde5": "The knowledge gap between the people who actively follow this stuff and the 99% of the population who do not is vast.\nThe pace of change doesn’t help either. In just the past month we’ve seen general availability of live interfaces where you can point your phone’s camera at something and talk about it with your voice... and optionally have it pretend to be Santa. Most self-certified nerds haven’t even tried that yet.\nGiven the ongoing (and potential) impact on society that this technology has, I don’t think the size of this gap is healthy. I’d like to see a lot more effort put into improving this.\nLLMs need better criticism", "3b1f6b05-f589-41b3-b6e7-e9e29a5fdf27": "A lot of people absolutely hate this stuff. In some of the spaces I hang out (Mastodon, Bluesky, Lobste.rs, even Hacker News on occasion) even suggesting that “LLMs are useful” can be enough to kick off a huge fight.\nI get it. There are plenty of reasons to dislike this technology—the environmental impact, the (lack of) ethics of the training data, the lack of reliability, the negative applications, the potential impact on people’s jobs.\nLLMs absolutely warrant criticism. We need to be talking through these problems, finding ways to mitigate them and helping people learn how to use these tools responsibly in ways where the positive applications outweigh the negative.", "ff417854-5a35-40a5-90db-b23eb7215bf5": "I like people who are skeptical of this stuff. The hype has been deafening for more than two years now, and there are enormous quantities of snake oil and misinformation out there. A lot of very bad decisions are being made based on that hype. Being critical is a virtue.\nIf we want people with decision-making authority to make good decisions about how to apply these tools we first need to acknowledge that there ARE good applications, and then help explain how to put those into practice while avoiding the many unintiutive traps.\n(If you still don’t think there are any good applications at all I’m not sure why you made it to this point in the article!)", "d3747ab2-52bf-4cd9-997f-29d585a2a04e": "I think telling people that this whole field is environmentally catastrophic plagiarism machines that constantly make things up is doing those people a disservice, no matter how much truth that represents. There is genuine value to be had here, but getting to that value is unintuitive and needs guidance.\nThose of us who understand this stuff have a duty to help everyone else figure it out.\nEverything tagged “llms” on my blog in 2024\nBecause I undoubtedly missed a whole bunch of things, here’s every long-form post I wrote in 2024 that I tagged with llms:", "93663f3f-4f01-4ced-a97c-ffbd4d15a95f": "January\n\n7th: It’s OK to call it Artificial Intelligence\n\n9th: What I should have said about the term Artificial Intelligence\n\n17th: Talking about Open Source LLMs on Oxide and Friends\n\n26th: LLM 0.13: The annotated release notes\n\n\n\nFebruary\n\n21st: The killer app of Gemini Pro 1.5 is video\n\n\n\nMarch\n\n5th: Prompt injection and jailbreaking are not the same thing\n\n8th: The GPT-4 barrier has finally been broken\n\n22nd: Claude and ChatGPT for ad-hoc sidequests\n\n23rd: Building and testing C extensions for SQLite with ChatGPT Code Interpreter\n\n26th: llm cmd undo last git commit—a new plugin for LLM\n\n\n\nApril\n\n8th: Building files-to-prompt entirely using Claude 3 Opus\n\n10th: Three major LLM releases in 24 hours (plus weeknotes)", "5341fa2e-4b7f-4736-86eb-0c604deba411": "17th: AI for Data Journalism: demonstrating what we can do with this stuff right now\n\n22nd: Options for accessing Llama 3 from the terminal using LLM\n\n\n\nMay\n\n8th: Slop is the new name for unwanted AI-generated content\n\n15th: ChatGPT in “4o” mode is not running the new features yet\n\n29th: Training is not the same as chatting: ChatGPT and other LLMs don’t remember everything you say\n\n\n\nJune\n\n6th: Accidental prompt injection against RAG applications\n\n10th: Thoughts on the WWDC 2024 keynote on Apple Intelligence\n\n17th: Language models on the command-line\n\n21st: Building search-based RAG using Claude, Datasette and Val Town\n\n27th: Open challenges for AI engineering\n\n\n\nJuly\n\n14th: Imitation Intelligence, my keynote for PyCon US 2024", "f479a9e9-61df-4f9c-8ce7-c7e64756a714": "19th: Weeknotes: GPT-4o mini, LLM 0.15, sqlite-utils 3.37 and building a staging environment\n\n\n\nAugust\n\n6th: Weeknotes: a staging environment, a Datasette alpha and a bunch of new LLMs\n\n8th: django-http-debug, a new Django app mostly written by Claude\n\n23rd: Claude’s API now supports CORS requests, enabling client-side applications\n\n26th: Building a tool showing how Gemini Pro can return bounding boxes for objects in images\n\n\n\nSeptember\n\n6th: Calling LLMs from client-side JavaScript, converting PDFs to HTML + weeknotes\n\n10th: Notes from my appearance on the Software Misadventures Podcast\n\n12th: Notes on OpenAI’s new o1 chain-of-thought models\n\n20th: Notes on using LLMs for code", "557a2e4d-f436-41ee-adfa-2dbcd0d7f347": "29th: NotebookLM’s automatically generated podcasts are surprisingly effective\n\n30th: Weeknotes: Three podcasts, two trips and a new plugin system\n\n\n\nOctober\n\n1st: OpenAI DevDay 2024 live blog\n\n2nd: OpenAI DevDay: Let’s build developer tools, not digital God\n\n15th: ChatGPT will happily write you a thinly disguised horoscope\n\n17th: Video scraping: extracting JSON data from a 35 second screen capture for less than 1/10th of a cent\n\n18th: Experimenting with audio input and output for the OpenAI Chat Completion API\n\n19th: Running Llama 3.2 Vision and Phi-3.5 Vision on a Mac with mistral.rs\n\n21st: Everything I built with Claude Artifacts this week\n\n22nd: Initial explorations of Anthropic’s new Computer Use capability", "18dd5065-c287-4393-9d6e-d08d20c21e9c": "24th: Notes on the new Claude analysis JavaScript code execution tool\n\n27th: Run a prompt to generate and execute jq programs using llm-jq\n\n29th: You can now run prompts against images, audio and video in your terminal using LLM\n\n30th: W̶e̶e̶k̶n̶o̶t̶e̶s̶  Monthnotes for October\n\n\n\nNovember\n\n4th: Claude 3.5 Haiku\n\n7th: Project: VERDAD—tracking misinformation in radio broadcasts using Gemini 1.5\n\n12th: Qwen2.5-Coder-32B is an LLM that can code well that runs on my Mac\n\n19th: Notes from Bing Chat—Our First Encounter With Manipulative AI\n\n25th: Ask questions of SQLite databases and CSV/JSON files in your terminal\n\n\n\nDecember\n\n4th: First impressions of the new Amazon Nova LLMs (via a new llm-bedrock plugin)\n\n7th: Prompts.js", "469f3f71-913f-406f-9d23-f6b09a85d9e5": "7th: Prompts.js\n\n9th: I can now run a GPT-4 class model on my laptop\n\n10th: ChatGPT Canvas can make API requests now, but it’s complicated\n\n11th: Gemini 2.0 Flash: An outstanding multi-modal LLM with a sci-fi streaming mode\n\n19th: Building Python tools with a one-shot prompt using uv run and Claude Projects\n\n19th: Gemini 2.0 Flash “Thinking mode”\n\n20th: December in LLMs has been a lot\n\n20th: Live blog: the 12th day of OpenAI—“Early evals for OpenAI o3”\n\n24th: Trying out QvQ—Qwen’s new visual reasoning model\n\n31st: Things we learned about LLMs in 2024\n\n\n\n\n(This list generated using Django SQL Dashboard with a SQL query written for me by Claude.)"}}